{"href":"6631327.html","title":"6,631,372","content":"<font face=\"verdana\" size=\"2\">March 2006, rev August 2009<br/><br/>A couple days ago I found to my surprise that I'd been granted a\n<a href=\"http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PALL&amp;p=1&amp;u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&amp;r=1&amp;f=G&amp;l=50&amp;s1=6,631,372.PN.&amp;OS=PN/6,631,372&amp;RS=PN/6,631,372\">patent</a>.\nIt issued in 2003, but no one told me.  I wouldn't know about it\nnow except that a few months ago, while visiting Yahoo, I happened\nto run into a Big Cheese I knew from working there in the late\nnineties.  He brought up something called Revenue Loop, which Viaweb\nhad been working on when they bought us.<br/><br/>The idea is basically that you sort search results not in order of\ntextual \"relevance\" (as search engines did then) nor in order of\nhow much advertisers bid (as Overture did) but in order of the bid\ntimes the number of transactions.  Ordinarily you'd do this for\nshopping searches, though in fact one of the features of our scheme\nis that it automatically detects which searches are shopping searches.<br/><br/>If you just order the results in order of bids, you can make the\nsearch results useless, because the first results could be dominated\nby lame sites that had bid the most.  But if you order results by\nbid multiplied by transactions, far from selling out, you're getting\na <i>better</i> measure of relevance.  What could be a better sign that\nsomeone was satisfied with a search result than going to the site\nand buying something?<br/><br/>And, of course, this algorithm automatically maximizes the revenue\nof the search engine.<br/><br/>Everyone is focused on this type of approach now, but few were in\n1998.  In 1998 it was all about selling banner ads.  We didn't know\nthat, so we were pretty excited when we figured out what seemed to\nus the optimal way of doing shopping searches.<br/><br/>When Yahoo was thinking of buying us, we had a meeting with Jerry\nYang in New York.  For him, I now realize, this was supposed to be\none of those meetings when you check out a company you've pretty\nmuch decided to buy, just to make sure they're ok guys.  We weren't\nexpected to do more than chat and seem smart and reasonable.  He\nmust have been dismayed when I jumped up to the whiteboard and\nlaunched into a presentation of our exciting new technology.<br/><br/>I was just as dismayed when he didn't seem to care at all about it.\nAt the time I thought, \"boy, is this guy poker-faced.  We present\nto him what has to be the optimal way of sorting product search\nresults, and he's not even curious.\"  I didn't realize till much later\nwhy he didn't care.  In 1998, advertisers were overpaying enormously\nfor ads on web sites.  \nIn 1998, if advertisers paid the maximum that traffic was worth to\nthem, Yahoo's revenues would have <i>decreased.</i><br/><br/>Things are different now, of course.  Now this sort of thing is all\nthe rage.  So when I ran into the Yahoo exec I knew from the old\ndays in the Yahoo cafeteria a few months ago, the first thing he\nremembered was not (fortunately) all the fights I had with him, but\nRevenue Loop.<br/><br/>\"Well,\" I said, \"I think we actually applied for a patent on it.\nI'm not sure what happened to the application after I left.\"<br/><br/>\"Really?  That would be an important patent.\"<br/><br/>So someone investigated, and sure enough, that patent application\nhad continued in the pipeline for several years after, and finally\nissued in 2003.<br/><br/>The main thing that struck me on reading it, actually, is that\nlawyers at some point messed up my nice clear writing.  Some clever\nperson with a spell checker reduced one section to Zen-like incomprehensibility:\n<blockquote>\n  Also, common spelling errors will tend to get fixed. For example,\n  if users searching for \"compact disc player\" end up spending\n  considerable money at sites offering compact disc players, then\n  those pages will have a higher relevance for that search phrase,\n  even though the phrase \"compact disc player\" is not present on\n  those pages.\n</blockquote>\n(That \"compat disc player\" wasn't a typo, guys.)<br/><br/>For the fine prose of the original, see the provisional application\nof February 1998, back when we were still Viaweb and couldn't afford\nto pay lawyers to turn every \"a lot of\" into \"considerable.\"<br/><br/></font>","date":"2006-03-01T00:00:00Z"}