{"href":"goodwriting.html","title":"Good Writing","content":"<font face=\"verdana\" size=\"2\">May 2025<br/><br/>There are two senses in which writing can be good: it can\r\nsound good, and the ideas can be right. It can have nice,\r\nflowing sentences, and it can draw correct conclusions\r\nabout important things. It might seem as if these two\r\nkinds of good would be unrelated, like the speed of a car\r\nand the color it's painted. And yet I don't think they\r\nare. I think writing that sounds good is more likely to\r\nbe right.<br/><br/>So here we have the most exciting kind of idea: one that\r\nseems both preposterous and true. Let's examine it. How\r\ncan this possibly be true?<br/><br/>I know it's true from writing. You can't simultaneously\r\noptimize two unrelated things; when you push one far\r\nenough, you always end up sacrificing the other. And yet\r\nno matter how hard I push, I never find myself having to\r\nchoose between the sentence that sounds best and the one\r\nthat expresses an idea best. If I did, it would be\r\nfrivolous to care how sentences sound. But in practice it\r\nfeels the opposite of frivolous. Fixing sentences that\r\nsound bad seems to help get the ideas right.\r\n<font color=\"#dddddd\">[<a href=\"#f1n\"><font color=\"#dddddd\">1</font></a>]</font><br/><br/>By right I mean more than just true. Getting the ideas\r\nright means developing them well — drawing the\r\nconclusions that matter most, and exploring each one to\r\nthe right level of detail. So getting the ideas right is\r\nnot just a matter of saying true things, but saying the\r\nright true things.<br/><br/>How could trying to make sentences sound good help you do\r\nthat? The clue to the answer is something I noticed 30\r\nyears ago when I was doing the layout for my first book.\r\nSometimes when you're laying out text you have bad luck.\r\nFor example, you get a section that runs one line longer\r\nthan the page. I don't know what ordinary typesetters do\r\nin this situation, but what I did was rewrite the section\r\nto make it a line shorter. You'd expect such an arbitrary\r\nconstraint to make the writing worse. But I found, to my\r\nsurprise, that it never did. I always ended up with\r\nsomething I liked better.<br/><br/>I don't think this was because my writing was especially\r\ncareless. I think if you pointed to a random paragraph in\r\nanything written by anyone and told them to make it\r\nslightly shorter (or longer), they'd probably be able to\r\ncome up with something better.<br/><br/>The best analogy for this phenomenon is when you shake a\r\nbin full of different objects. The shakes are arbitrary\r\nmotions. Or more precisely, they're not calculated to\r\nmake any two specific objects fit more closely together.\r\nAnd yet repeated shaking inevitably makes the objects\r\ndiscover brilliantly clever ways of packing themselves.\r\nGravity won't let them become less tightly packed, so any\r\nchange has to be a change for the better.\r\n<font color=\"#dddddd\">[<a href=\"#f2n\"><font color=\"#dddddd\">2</font></a>]</font><br/><br/>So it is with writing. If you have to rewrite an awkward\r\npassage, you'll never do it in a way that makes it <i>less</i>\r\ntrue. You couldn't bear it, any more than gravity could\r\nbear things floating upward. So any change in the ideas\r\nhas to be a change for the better.<br/><br/>It's obvious once you think about it. Writing that sounds\r\ngood is more likely to be right for the same reason that\r\na well-shaken bin is more likely to be tightly packed.\r\nBut there's something else going on as well. Sounding\r\ngood isn't just a random external force that leaves the\r\nideas in an essay better off. It actually helps you to\r\nget them right.<br/><br/>The reason is that it makes the essay easier to read.\r\nIt's less work to read writing that flows well. How does\r\nthat help the writer? <i>Because the writer is the first\r\nreader.</i> When I'm working on an essay, I spend far more\r\ntime reading than writing. I'll reread some parts 50 or\r\n100 times, replaying the thoughts in them and asking\r\nmyself, like someone sanding a piece of wood, does\r\nanything catch? Does anything feel wrong? And the easier\r\nthe essay is to read, the easier it is to notice if\r\nsomething catches.<br/><br/>So yes, the two senses of good writing are connected in\r\nat least two ways. Trying to make writing sound good\r\nmakes you fix mistakes unconsciously, and also helps you\r\nfix them consciously; it shakes the bin of ideas, and\r\nalso makes mistakes easier to see. But now that we've\r\ndissolved one layer of preposterousness, I can't resist\r\nadding another. Does sounding good do more than just help\r\nyou get the ideas right? Is writing that sounds good\r\n<i>inherently</i> more likely to be right? Crazy as it may\r\nseem, I think that's true too.<br/><br/>Obviously there's a connection at the level of individual\r\nwords. There are lots of words in English that sound like\r\nwhat they mean, often in wonderfully subtle ways.\r\nGlitter. Round. Scrape. Prim. Cavalcade. But the sound of\r\ngood writing depends even more on the way you put words\r\ntogether, and there's a connection at that level too.<br/><br/>When writing sounds good, it's mostly because it has good\r\nrhythm. But the rhythm of good writing is not the rhythm\r\nof music, or the meter of verse. It's not so regular. If\r\nit were, it wouldn't be good, because the rhythm of good\r\nwriting has to match the ideas in it, and ideas have all\r\nkinds of different shapes. Sometimes they're simple and\r\nyou just state them. But other times they're more subtle,\r\nand you need longer, more complicated sentences to tease\r\nout all the implications.<br/><br/>An essay is a cleaned up train of thought, in the same\r\nway dialogue is cleaned up conversation, and a train of\r\nthought has a natural rhythm. So when an essay sounds\r\ngood, it's not merely because it has a pleasing rhythm,\r\nbut because it has its natural one. Which means you can\r\nuse getting the rhythm right as a heuristic for getting\r\nthe ideas right. And not just in principle: good writers\r\ndo both simultaneously as a matter of course. Often I\r\ndon't even distinguish between the two problems. I just\r\nthink Ugh, this doesn't sound right; what do I mean to\r\nsay here?\r\n<font color=\"#dddddd\">[<a href=\"#f3n\"><font color=\"#dddddd\">3</font></a>]</font><br/><br/>The sound of writing turns out to be more like the shape\r\nof a plane than the color of a car. If it looks good, as\r\nKelly Johnson used to say, it will fly well.<br/><br/>This is only true of writing that's used to develop\r\nideas, though. It doesn't apply when you have ideas in\r\nsome other way and then write about them afterward — for\r\nexample, if you build something, or conduct an\r\nexperiment, and then write a paper about it. In such\r\ncases the ideas often live more in the work than the\r\nwriting, so the writing can be bad even though the ideas\r\nare good. The writing in textbooks and popular surveys\r\ncan be bad for the same reason: the author isn't\r\ndeveloping the ideas, merely describing other people's.\r\nIt's only when you're writing to develop ideas that\r\nthere's such a close connection between the two senses of\r\ndoing it well.<br/><br/>Ok, many people will be thinking, this seems plausible so\r\nfar, but what about liars? Is it not notoriously possible\r\nfor a smooth-tongued liar to write something beautiful\r\nthat's completely false?<br/><br/>It is, of course. But not without method acting. The way\r\nto write something beautiful and false is to begin by\r\nmaking yourself almost believe it. So just like someone\r\nwriting something beautiful and true, you're presenting a\r\nperfectly-formed train of thought. The difference is the\r\npoint where it attaches to the world. You're saying\r\nsomething that would be true if certain false premises\r\nwere. If for some bizarre reason the number of jobs in a\r\ncountry were fixed, then immigrants really would be\r\ntaking our jobs.<br/><br/>So it's not quite right to say that better sounding\r\nwriting is more likely to be true. Better sounding\r\nwriting is more likely to be internally consistent. If\r\nthe writer is honest, internal consistency and truth\r\nconverge.<br/><br/>But while we can't safely conclude that beautiful writing\r\nis true, it's usually safe to conclude the converse:\r\nsomething that seems clumsily written will usually have\r\ngotten the ideas wrong too.<br/><br/>Indeed, the two senses of good writing are more like two\r\nends of the same thing. The connection between them is\r\nnot a rigid one; the goodness of good writing is not a\r\nrod but a rope, with multiple overlapping connections\r\nrunning through it. But it's hard to move one end without\r\nmoving the other. It's hard to be right without sounding\r\nright.<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>\n<b>Notes</b><br/><br/>[<a name=\"f1n\"><font color=\"#000000\">1</font></a>]\r\nThe closest thing to an exception is when you have\r\nto go back and insert a new point into the middle of\r\nsomething you've written. This often messes up the flow,\r\nsometimes in ways you can never quite repair. But I think\r\nthe ultimate source of this problem is that ideas are\r\ntree-shaped and essays are linear. You inevitably run\r\ninto difficulties when you try to cram the former into\r\nthe latter. Frankly it's suprising how much you can get\r\naway with. But even so you sometimes have to resort to an\r\nendnote.<br/><br/>[<a name=\"f2n\"><font color=\"#000000\">2</font></a>]\r\nObviously if you shake the bin hard enough the\r\nobjects in it can become less tightly packed. And\r\nsimilarly, if you imposed some huge external constraint\r\non your writing, like using alternating one and two\r\nsyllable words, the ideas would start to suffer.<br/><br/>[<a name=\"f3n\"><font color=\"#000000\">3</font></a>]\r\nBizarrely enough, this happened in the writing of\r\nthis very paragraph. An earlier version shared several\r\nphrases in common with the preceding paragraph, and the\r\nrepetition bugged me each time I reread it. When I got\r\nannoyed enough to fix it, I discovered that the\r\nrepetition reflected a problem in the underlying ideas,\r\nand I fixed both simultaneously.<br/><br/><br/><br/>\n<font color=\"888888\"><b>Thanks</b> to Jessica Livingston \r\nand Courtenay Pipkin for reading drafts of this.<br/><br/></font></font>","date":"2025-05-01T00:00:00Z"}