{"href":"hw.html","title":"The Hardware Renaissance","content":"<font face=\"verdana\" size=\"2\"><table cellspacing=\"0\" width=\"100%\">\n<tr><td bgcolor=\"#ff9922\"><img height=\"15\" src=\"http://www.virtumundo.com/images/spacer.gif\" width=\"1\"/><font size=\"2\">\n<b>Want to start a startup?</b>  Get funded by\n<a href=\"http://ycombinator.com/apply.html\">Y Combinator</a>.\n</font>\n<br/><img height=\"5\" src=\"http://www.virtumundo.com/images/spacer.gif\" width=\"1\"/></td></tr>\n</table>\n<p>\nOctober 2012<br/><br>One advantage of Y Combinator's early, broad focus is that we\nsee trends before most other people.  And one of the most conspicuous\ntrends in the last batch was the large number of hardware startups.\nOut of 84 companies, 7 were making hardware.  On the whole\nthey've done better than the companies that weren't.<br/><br/>They've faced resistance from investors of course.  Investors have\na deep-seated bias against hardware.  But investors' opinions are\na trailing indicator.  The best founders are better at seeing the\nfuture than the best investors, because the best founders are making\nit.<br/><br/>There is no one single force driving this trend.  Hardware <a href=\"http://bits.blogs.nytimes.com/2012/05/11/pebble-smartwatch-tops-out-at-10-million-on-kickstarter/\">does\nwell</a> on crowdfunding sites.  The spread of <a href=\"http://paulgraham.com/tablets.html\">tablets</a> makes it\npossible to build new things <a href=\"http://lockitron.com\">controlled\nby</a> and even <a href=\"http://doublerobotics.com\">incorporating</a>\nthem.  <a href=\"http://www.boostedboards.com/\">Electric motors</a>\n have improved.\nWireless connectivity of various types can now be taken for granted.\nIt's getting more straightforward to get things manufactured.\nArduinos, 3D printing, laser cutters, and more accessible CNC milling are making hardware easier to prototype.\nRetailers are less of a bottleneck as customers increasingly buy\nonline.<br/><br/>One question I can answer is why hardware is suddenly cool.\nIt always was cool.\nPhysical things are great.  They just haven't\nbeen as great a way to start a <a href=\"https://paulgraham.com/growth.html\">rapidly growing</a> business\nas software.  But that rule may not be permanent.  It's not even\nthat old; it only dates from about 1990.  Maybe the advantage\nof software will turn out to have been temporary.  Hackers love to\nbuild hardware, and customers love to buy it.  So if the ease of\nshipping hardware even approached the ease of shipping software,\nwe'd see a lot more hardware startups.<br/><br/>It wouldn't be the first time something was a bad idea till it\nwasn't.  And it wouldn't be the first time investors learned that\nlesson from founders.<br/><br/>So if you want to work on hardware, don't be deterred from doing\nit because you worry investors will discriminate against you.  And\nin particular, don't be deterred from <a href=\"http://ycombinator.com/apply.html\">applying</a> to Y Combinator\nwith a hardware idea, because we're especially interested in hardware\nstartups.<br/><br/>We know there's room for the <a href=\"https://paulgraham.com/ambitious.html\">next Steve Jobs</a>.\nBut there's almost certainly also room for the first \n&lt;Your Name Here&gt;.<br/><br/><br/><br/><br/><br/>\n<b>Thanks</b> to Sam Altman, Trevor Blackwell, David Cann, Sanjay Dastoor, \nPaul Gerhardt, Cameron Robertson, Harj Taggar, and Garry Tan for reading drafts of this.<br/><br/></br></p></font>","date":"2012-10-01T00:00:00Z"}