{"href":"iflisp.html","title":"If Lisp is So Great","content":"<font face=\"verdana\" size=\"2\">May 2003<br/><br/>If Lisp is so great, why don't more people use it?  I was    \nasked this question by a student in the audience at a \ntalk I gave recently.  Not for the first time, either.<br/><br/>In languages, as in so many things, there's not much     \ncorrelation between popularity and quality.  Why does   \nJohn Grisham (<i>King of Torts</i> sales rank, 44) outsell\nJane Austen (<i>Pride and Prejudice</i> sales rank, 6191)?\nWould even Grisham claim that it's because he's a better\nwriter?<br/><br/>Here's the first sentence of <i>Pride and Prejudice:</i>\n<blockquote>\nIt is a truth universally acknowledged, that a single man \nin possession of a good fortune must be in want of a\nwife.\n</blockquote>\n\"It is a truth universally acknowledged?\"  Long words for\nthe first sentence of a love story.<br/><br/>Like Jane Austen, Lisp looks hard.  Its syntax, or lack\nof syntax, makes it look completely <a href=\"https://sep.turbifycdn.com/ty/cdn/paulgraham/acl2.lisp?t=1688221954&amp;\">unlike</a> \nthe languages\nmost people are used to.  Before I learned Lisp, I was afraid\nof it too.  I recently came across a notebook from 1983\nin which I'd written:\n<blockquote>\nI suppose I should learn Lisp, but it seems so foreign.\n</blockquote>\nFortunately, I was 19 at the time and not too resistant to learning\nnew things.  I was so ignorant that learning\nalmost anything meant learning new things.<br/><br/>People frightened by Lisp make up other reasons for not\nusing it.  The standard\nexcuse, back when C was the default language, was that Lisp\nwas too slow.  Now that Lisp dialects are among\nthe <a href=\"http://shootout.alioth.debian.org/benchmark.php?test=nestedloop&amp;lang=all&amp;sort=cpu\">faster</a>\nlanguages available, that excuse has gone away.\nNow the standard excuse is openly circular: that other languages\nare more popular.<br/><br/>(Beware of such reasoning.  It gets you Windows.)<br/><br/>Popularity is always self-perpetuating, but it's especially\nso in programming languages. More libraries\nget written for popular languages, which makes them still\nmore popular.  Programs often have to work with existing programs,\nand this is easier if they're written in the same language,\nso languages spread from program to program like a virus.\nAnd managers prefer popular languages, because they give them \nmore leverage over developers, who can more easily be replaced.<br/><br/>Indeed, if programming languages were all more or less equivalent,\nthere would be little justification for using any but the most\npopular.  But they <a href=\"icad.html\">aren't</a> all equivalent, not by a long\nshot.  And that's why less popular languages, like Jane Austen's \nnovels, continue to survive at all.  When everyone else is reading \nthe latest John Grisham novel, there will always be a few people \nreading Jane Austen instead.<br/><br/></font>","date":"2003-05-01T00:00:00Z"}