{"href":"laundry.html","title":"A Version 1.0","content":"<font face=\"verdana\" size=\"2\">October 2004<br/><br/><!--At the end of each day I save a copy of whatever I'm working on.\nI thought it would be interesting to compare a finished\nessay with the first version to see how much of the original  \ntext survives.\n-->\nAs E. B. White said, \"good writing is rewriting.\"  I didn't\nrealize this when I was in school.  In writing, as in math and \nscience, they only show you the finished product.\nYou don't see all the false starts.  This gives students a\nmisleading view of how things get made.<br/><br/>Part of the reason it happens is that writers don't want   \npeople to see their mistakes.  But I'm willing to let people\nsee an early draft if it will show how much you have\nto rewrite to beat an essay into shape.<br/><br/>Below is the oldest version I can find of\n<a href=\"essay.html\">The Age of the Essay</a>   \n(probably the second or third day), with\ntext that ultimately survived in \n<font color=\"#aa0000\">red</font> and text that later\ngot deleted in <font color=\"#777777\">gray</font>.\nThere seem to be several categories of cuts: things I got wrong,\nthings that seem like bragging, flames,\ndigressions, stretches of awkward prose, and unnecessary words.<br/><br/>I discarded more from the beginning.  That's\nnot surprising; it takes a while to hit your stride.  There\nare more digressions at the start, because I'm not sure where\nI'm heading.<br/><br/>The amount of cutting is about average.  I probably write\nthree to four words for every one that appears in the final\nversion of an essay.<br/><br/>(Before anyone gets mad at me for opinions expressed here, remember\nthat anything you see here that's not in the final version is obviously\nsomething I chose not to publish, often because I disagree\nwith it.)<br/><br/><br/><br/><font color=\"#777777\">\nRecently a friend said that what he liked about\nmy essays was that they weren't written the way\nwe'd been taught to write essays in school.  You\nremember: <font color=\"#aa0000\">topic sentence, introductory paragraph,\nsupporting paragraphs, conclusion.</font>  It hadn't\noccurred to me till then that those horrible things\nwe had to write in school were even connected to\nwhat I was doing now.  But sure enough, I thought,\nthey did call them \"essays,\" didn't they?<br/><br/>Well, they're not.  Those things you have to write\nin school are not only not essays, they're one of the\nmost pointless of all the pointless hoops you have\nto jump through in school.  And I worry that they\nnot only teach students the wrong things about writing,\nbut put them off writing entirely.<br/><br/><font color=\"#aa0000\">So I'm going to give the other side of the story: what\nan essay really is, and how you write one.  Or at least,\nhow I write one.</font>  Students be forewarned: if you actually write\nthe kind of essay I describe, you'll probably get bad\ngrades.  But knowing how it's really done should\nat least help you to understand the feeling of futility\nyou have when you're writing the things they tell you to.<br/><br/><font color=\"#aa0000\">\nThe most obvious difference between real essays and\nthe things one has to write in school is that real\nessays are not exclusively about English literature.</font>\nIt's a fine thing for schools to\n<font color=\"#aa0000\">\nteach students how to\nwrite.</font>  But for some bizarre reason (actually, a very specific bizarre\nreason that I'll explain in a moment),\n<font color=\"#aa0000\">\nthe teaching of\nwriting has gotten mixed together with the study\nof literature.  And so all over the country, students are\nwriting not about how a baseball team with a small budget \nmight compete with the Yankees, or the role of color in\nfashion, or what constitutes a good dessert, but about\nsymbolism in Dickens.</font><br/><br/><font color=\"#aa0000\">With</font> obvious \n<font color=\"#aa0000\">result</font>s.  Only a few people really\n<font color=\"#aa0000\">\ncare about\nsymbolism in Dickens.</font>  The teacher doesn't.\nThe students don't.  Most of the people who've had to write PhD\ndisserations about Dickens don't.  And certainly\n<font color=\"#aa0000\">\nDickens himself would be more interested in an essay\nabout color or baseball.<br/><br/>How did things get this way?  To answer that we have to go back\nalmost a thousand years.</font>  Between about 500 and 1000, life was\nnot very good in Europe.  The term \"dark ages\" is presently\nout of fashion as too judgemental (the period wasn't dark; \nit was just <i>different</i>), but if this label didn't already\nexist, it would seem an inspired metaphor.  What little\noriginal thought there was took place in lulls between\nconstant wars and had something of the character of\nthe thoughts of parents with a new baby.\nThe most amusing thing written during this\nperiod, Liudprand of Cremona's Embassy to Constantinople, is,\nI suspect, mostly inadvertantly so.<br/><br/>Around 1000 <font color=\"#aa0000\">Europe began to catch its breath.\nAnd once they\nhad the luxury of curiosity,</font> one of the first things they discovered\nwas <font color=\"#aa0000\">what we call \"the classics.\"</font>\nImagine if <font color=\"#aa0000\">we were visited  \nby</font> aliens.  If they could even get here they'd presumably know a\nfew things we don't.  Immediately Alien Studies would become\nthe most dynamic field of scholarship: instead of painstakingly\ndiscovering things for ourselves, we could simply suck up\neverything they'd discovered.  So it was in Europe in 1200.\nWhen classical texts began to circulate in Europe, they contained\nnot just new answers, but new questions.  (If anyone proved\na theorem in christian Europe before 1200, for example, there\nis no record of it.)<br/><br/>For a couple centuries, some of the most important work\nbeing done was intellectual archaelogy.  Those were also\nthe centuries during which schools were first established.\nAnd since reading ancient texts was the <font color=\"#aa0000\">essence of what\nscholars did</font> then, it became the basis of the curriculum.<br/><br/>By 1700, <font color=\"#aa0000\">someone who wanted to learn about</font>\nphysics didn't need to start by mastering Greek in order to read <font color=\"#aa0000\">Aristotle.  But schools\nchange slower than scholarship</font>: <font color=\"#aa0000\">the study of\nancient texts</font>\nhad such prestige that it remained <font color=\"#aa0000\">the backbone of</font> \neducation\nuntil the late 19th century.  By then it was merely a tradition.\nIt did serve some purposes: reading a foreign language was difficult,\nand thus taught discipline, or at least, kept students busy;\nit introduced students to\ncultures quite different from their own; and its very uselessness\nmade it function (like white gloves) as a social bulwark.\nBut it certainly wasn't\ntrue, and hadn't been true for centuries, that students were\nserving apprenticeships in the hottest area of scholarship.<br/><br/>Classical scholarship had also changed.  In the early era, philology\nactually mattered.  The texts that filtered into Europe were\nall corrupted to some degree by the errors of translators and\ncopyists.  Scholars had to figure out what Aristotle said\nbefore they could figure out what he meant.  But by the modern\nera such questions were answered as well as they were ever\ngoing to be.  And so the study of ancient texts became less\nabout ancientness and more about texts.<br/><br/><font color=\"#aa0000\">The time was then ripe for the question: if the study of\nancient texts is a valid field for scholarship, why not modern\ntexts?  The answer, of course, is that the raison d'etre\nof classical scholarship was a kind of intellectual archaelogy that\ndoes not need to be done in the case of contemporary authors.\nBut for obvious reasons no one wanted to give that answer.\nThe archaeological work being mostly done, it implied that\nthe people studying the classics were, if not wasting their\ntime, at least working on problems of minor importance.<br/><br/>And so began the study of modern literature. There was</font> some\ninitial <font color=\"#aa0000\">resistance</font>, but it didn't last long.\nThe limiting\nreagent in the growth of university departments is what\nparents will let undergraduates study.  If parents will let\ntheir children major in x, the rest follows straightforwardly.\nThere will be jobs teaching x, and professors to fill them.\nThe professors will establish scholarly journals and publish\none another's papers.  Universities with x departments will\nsubscribe to the journals.  Graduate students who want jobs\nas professors of x will write dissertations about it.  It may\ntake a good long while for the more prestigious universities\nto cave in and establish departments in cheesier xes,  but\nat the other end of the scale there are so many universities\ncompeting to attract students that the mere establishment of\na discipline requires little more than the desire to do it.<br/><br/><font color=\"#aa0000\">High schools imitate universities.</font>\nAnd so once university\nEnglish departments were established in the late nineteenth century,\n<font color=\"#aa0000\">the 'riting component of the 3 Rs</font> \nwas <font color=\"#aa0000\">morphed into English.\nWith the bizarre consequence that high school students now\nhad to write about English literature-- to write, without\neven realizing it, imitations of whatever\nEnglish professors had been publishing in their journals a\nfew decades before.   It's no wonder if this seems to the\nstudent a pointless exercise, because we're now three steps\nremoved from real work: the students are imitating English\nprofessors, who are imitating classical scholars, who are\nmerely the inheritors of a tradition growing out of what\nwas, 700 years ago, fascinating and urgently needed work.</font><br/><br/>Perhaps high schools should drop English and just teach writing.\nThe valuable part of English classes is learning to write, and\nthat could be taught better by itself.  Students learn better\nwhen they're interested in what they're doing, and it's hard\nto imagine a topic less interesting than symbolism in Dickens.\nMost of the people who write about that sort of thing professionally\nare not really interested in it.  (Though indeed, it's been a\nwhile since they were writing about symbolism; now they're\nwriting about gender.)<br/><br/>I have no illusions about how eagerly this suggestion will  \nbe adopted.  Public schools probably couldn't stop teaching\nEnglish even if they wanted to; they're probably required to by\nlaw.  But here's a related suggestion that goes with the grain\ninstead of against it: that universities establish a\nwriting major.  Many of the students who now major in English\nwould major in writing if they could, and most would\nbe better off.<br/><br/>It will be argued that it is a good thing for students to be\nexposed to their literary heritage.  Certainly.  But is that\nmore important than that they learn to write well?  And are\nEnglish classes even the place to do it?  After all,\nthe average public high school student gets zero exposure to  \nhis artistic heritage.  No disaster results.\nThe people who are interested in art learn about it for\nthemselves, and those who aren't don't.  I find that American\nadults are no better or worse informed about literature than\nart, despite the fact that they spent years studying literature\nin high school and no time at all studying art.  Which presumably\nmeans that what they're taught in school is rounding error \ncompared to what they pick up on their own.<br/><br/>Indeed, English classes may even be harmful.  In my case they\nwere effectively aversion therapy.  Want to make someone dislike\na book?  Force him to read it and write an essay about it.\nAnd make the topic so intellectually bogus that you\ncould not, if asked, explain why one ought to write about it.\nI love to read more than anything, but by the end of high school\nI never read the books we were assigned.  I was so disgusted with\nwhat we were doing that it became a point of honor\nwith me to write nonsense at least as good at the other students'\nwithout having more than glanced over the book to learn the names\nof the characters and a few random events in it.<br/><br/>I hoped this might be fixed in college, but I found the same\nproblem there.  It was not the teachers.  It was English.   \nWe were supposed to read novels and write essays about them.\nAbout what, and why?  That no one seemed to be able to explain.\nEventually by trial and error I found that what the teacher  \nwanted us to do was pretend that the story had really taken\nplace, and to analyze based on what the characters said and did (the\nsubtler clues, the better) what their motives must have been.\nOne got extra credit for motives having to do with class,\nas I suspect one must now for those involving gender and  \nsexuality.  I learned how to churn out such stuff well enough\nto get an A, but I never took another English class.<br/><br/>And the books we did these disgusting things to, like those\nwe mishandled in high school, I find still have black marks\nagainst them in my mind.  The one saving grace was that   \nEnglish courses tend to favor pompous, dull writers like\nHenry James, who deserve black marks against their names anyway.\nOne of the principles the IRS uses in deciding whether to\nallow deductions is that, if something is fun, it isn't work.\nFields that are intellectually unsure of themselves rely on\na similar principle.  Reading P.G. Wodehouse or Evelyn Waugh or\nRaymond Chandler is too obviously pleasing to seem like\nserious work, as reading Shakespeare would have been before \nEnglish evolved enough to make it an effort to understand him. [sh]\nAnd so good writers (just you wait and see who's still in\nprint in 300 years) are less likely to have readers turned   \nagainst them by clumsy, self-appointed tour guides.<br/><br/>\n<font color=\"#aa0000\">The other big difference between a real essay and the \nthings\nthey make you write in school is that a real essay doesn't \ntake a position and then defend it.  That principle,\nlike the idea that we ought to be writing about literature,   \nturns out to be another intellectual hangover of long\nforgotten origins.  It's often mistakenly believed that\nmedieval universities were mostly seminaries.  In fact they\nwere more law schools.  And at least in our tradition\nlawyers are advocates</font>: they are\n<font color=\"#aa0000\">trained to</font> be able to\n<font color=\"#aa0000\">take\neither side of an argument and make as good a case for it  \nas they can. </font><br/><br/>Whether or not this is a good idea (in the case of prosecutors,\nit probably isn't), it tended to <font color=\"#aa0000\">pervade</font>\nthe atmosphere of\n<font color=\"#aa0000\">early universities.  After the lecture the most common form\nof discussion was the disputation.  This</font> idea\n<font color=\"#aa0000\">is at least\nnominally preserved in our present-day thesis defense</font>-- indeed,\nin the very word thesis.  <font color=\"#aa0000\">Most people treat the words \nthesis\nand dissertation as interchangeable, but originally, at least,\na thesis was a position one took and the dissertation was\nthe argument by which one defended it.</font><br/><br/>I'm not complaining that we blur these two words together.\nAs far as I'm concerned, the sooner we lose the original\nsense of the word thesis, the better.  For many, perhaps most,  \ngraduate students, it is stuffing a square peg into a round\nhole to try to recast one's work as a single thesis.  And\nas for the disputation, that seems clearly a net lose.\nArguing two sides of a case <font color=\"#aa0000\">may be a necessary evil in a\nlegal dispute, but it's not the best way to get at the truth,\nas I think lawyers would be the first to admit.</font><br/><br/><font color=\"#aa0000\">\nAnd yet this principle is built into the very structure of  \nthe</font> essays\n<font color=\"#aa0000\">they teach you to write in high school.  The topic\nsentence is your thesis, chosen in advance, the supporting \nparagraphs the blows you strike in the conflict, and the\nconclusion--- uh, what it the conclusion?  I was never sure  \nabout that in high school.</font>  If your thesis was well expressed,\nwhat need was there to restate it?  In theory it seemed that\nthe conclusion of a really good essay ought not to need to   \nsay any more than QED.\n<font color=\"#aa0000\">But when you understand the origins\nof this sort of \"essay\", you can see where the\nconclusion comes from.  It's the concluding remarks to the \njury.</font><br/><br/>\nWhat other alternative is there?  To answer that\n<font color=\"#aa0000\">we have to\nreach back into history again, though this time not so far.\nTo Michel de Montaigne,</font> inventor of the essay.\n<font color=\"#aa0000\">He was\ndoing something quite different from what</font> a\n<font color=\"#aa0000\">lawyer do</font>es,\n<font color=\"#aa0000\">and\nthe difference is embodied in the name.  Essayer is the French\nverb meaning \"to try\"</font> (the cousin of our word assay),\n<font color=\"#aa0000\">\nand an \"essai\" is an</font> effort.\n<font color=\"#aa0000\">An essay is something you\nwrite</font> in order\n<font color=\"#aa0000\">to figure something out.<br/><br/>Figure out what?  You don't know yet.  And so you can't begin with a\nthesis, because you don't have one, and may never have \none.  An essay doesn't begin with a statement, but with a  \nquestion.  In a real essay, you don't take a position and\ndefend it.  You see a door that's ajar, and you open it and\nwalk in to see what's inside.<br/><br/>If all you want to do is figure things out, why do you need\nto write anything, though?  Why not just sit and think?  Well,\nthere precisely is Montaigne's great discovery.  Expressing\nideas helps to form them.  Indeed, helps is far too weak a\nword.</font>  90%\n<font color=\"#aa0000\">of what ends up in my essays</font> was stuff\n<font color=\"#aa0000\">I only\nthought of when I sat down to write them.  That's why I\nwrite them.</font><br/><br/>So there's another difference between essays and\n<font color=\"#aa0000\">the things\nyou have to write in school</font>.   In school\n<font color=\"#aa0000\">\nyou are, in theory,\nexplaining yourself to</font> someone else.  In the best case---if\nyou're really organized---you're just writing it <i>down.</i>\n<font color=\"#aa0000\">In a real essay you're writing for yourself.  You're\nthinking out loud.<br/><br/>But not quite.  Just as inviting people over forces you to\nclean up your apartment, writing something that</font> you know\n<font color=\"#aa0000\">\nother people will read forces you to think well.  So it\ndoes matter to have an audience.  The things I've written\njust for myself are no good.</font>  Indeed, they're bad in\na particular way:\n<font color=\"#aa0000\">they tend to peter out.  When I run into\ndifficulties, I</font> notice that I\n<font color=\"#aa0000\">tend to conclude with a few vague\nquestions and then drift off to get a cup of tea.</font><br/><br/>This seems a common problem.\nIt's practically the standard\nending in blog entries--- with the addition of a \"heh\" or an \nemoticon, prompted by the all too accurate sense that\nsomething is missing.<br/><br/>And indeed, a lot of\n<font color=\"#aa0000\">published essays peter out in</font> this\n<font color=\"#aa0000\">same way.\nParticularly the sort written by the staff writers of newsmagazines.  Outside writers tend to supply\neditorials of the defend-a-position variety, which\nmake a beeline toward a rousing (and\nforeordained) conclusion.   But the staff writers feel\nobliged to write something</font> more\n<font color=\"#aa0000\">balanced</font>, which in\npractice ends up meaning blurry.\n<font color=\"#aa0000\">Since they're\nwriting for a popular magazine, they start with the\nmost radioactively controversial questions, from which</font>\n(<font color=\"#aa0000\">because they're writing for a popular magazine</font>)\n<font color=\"#aa0000\">they then proceed to recoil</font> from\n<font color=\"#aa0000\">in terror.</font>\nGay marriage, <font color=\"#aa0000\">for or\nagainst?  This group says one thing.  That group says\nanother.  One thing is certain: the question is a\ncomplex one.  (But don't get mad at us.  We didn't\ndraw any conclusions.)<br/><br/>Questions aren't enough.  An essay has to come up with answers.\nThey don't always, of course.  Sometimes you start with a  \npromising question and get nowhere.  But those you don't\npublish.  Those are like experiments that get inconclusive\nresults.   Something you publish ought to tell the reader  \nsomething he didn't already know.<br/><br/>\nBut <i>what</i> you tell him doesn't matter, so long as   \nit's interesting.  I'm sometimes accused of meandering.\nIn defend-a-position writing that would be a flaw.\nThere you're not concerned with truth.  You already\nknow where you're going, and you want to go straight there,\nblustering through obstacles, and hand-waving\nyour way across swampy ground.  But that's not what\nyou're trying to do in an essay.  An essay is supposed to\nbe a search for truth.  It would be suspicious if it didn't\nmeander.<br/><br/>The Meander is a river in</font> Asia Minor (aka\n<font color=\"#aa0000\">Turkey</font>).\n<font color=\"#aa0000\">As you might expect, it winds all over the place.\nBut</font> does it\n<font color=\"#aa0000\">do this out of frivolity</font>?   Quite the opposite.\nLike all rivers, it's rigorously following the laws of physics.\n<font color=\"#aa0000\">The path it has discovered</font>,\nwinding as it is, represents\n<font color=\"#aa0000\">the most economical route to the sea.<br/><br/>The river's algorithm is simple.  At each step, flow down.\nFor the essayist this translates to: flow interesting.\nOf all the places to go next, choose</font>\nwhichever seems\n<font color=\"#aa0000\">most interesting.</font><br/><br/>I'm pushing this metaphor a bit.  An essayist\n<font color=\"#aa0000\">can't have\nquite as little foresight as a river.</font>  In fact what you do\n(or what I do) is somewhere between a river and a roman\nroad-builder.  I have a general idea of the direction\nI want to go in, and\nI choose the next topic with that in mind.  This essay is\nabout writing, so I do occasionally yank it back in that\ndirection, but it is not all the sort of essay I\nthought I was going to write about writing.<br/><br/>Note too that hill-climbing (which is what this algorithm is\ncalled) can get you in trouble.\n<font color=\"#aa0000\">Sometimes,</font> just\n<font color=\"#aa0000\">like a river,</font>\nyou\n<font color=\"#aa0000\">run up against a blank wall.</font>  What\n<font color=\"#aa0000\">I do</font> then is just \n<font color=\"#aa0000\">what the river does: backtrack.\nAt one point in this essay\nI found that after following a certain thread I ran out\nof ideas.  I had to go back</font> n\n<font color=\"#aa0000\">paragraphs and start over\nin another direction.</font>  For illustrative purposes I've left\nthe abandoned branch as a footnote.<br/><br/><font color=\"#aa0000\">\nErr on the side of the river.  An essay is not a reference\nwork.  It's not something you read looking for a specific\nanswer, and feel cheated if you don't find it.  I'd much\nrather read an essay that went off in an unexpected but\ninteresting direction than one that plodded dutifully along\na prescribed course.<br/><br/>So what's interesting?  For me, interesting means surprise.\nDesign, as </font>Matz\n<font color=\"#aa0000\">has said, should follow the principle of\nleast</font> surprise.\n<font color=\"#aa0000\">A button that looks like it will make a\nmachine stop should make it stop, not speed up.  Essays\nshould do the opposite.  Essays should aim for maximum\nsurprise.<br/><br/>I was afraid of flying for a long time and could only travel\nvicariously.  When friends came back from faraway places,\nit wasn't just out of politeness that I asked them</font> about\ntheir trip.\n<font color=\"#aa0000\">I really wanted to know.  And I found</font> that\n<font color=\"#aa0000\">the best way to get information out of them was to ask\nwhat surprised them.  How was the place different from what\nthey expected?  This is an extremely useful question.\nYou can ask it of</font> even\n<font color=\"#aa0000\">the most unobservant people, and it will\nextract information they didn't even know they were\nrecording. </font><br/><br/>Indeed, you can ask it in real time.  Now when I go somewhere\nnew, I make a note of what surprises me about it.  Sometimes I\neven make a conscious effort to visualize the place beforehand,\nso I'll have a detailed image to diff with reality.<br/><br/><font color=\"#aa0000\">\nSurprises are</font> facts\n<font color=\"#aa0000\">you didn't</font> already \n<font color=\"#aa0000\">know</font>.\n<font color=\"#aa0000\">But</font> they're\nmore than that.  They're facts\n<font color=\"#aa0000\">that contradict things you\nthought you knew.  And so they're the most valuable sort of\nfact you can get.  They're like a food that's not merely\nhealthy, but counteracts the unhealthy effects of things\nyou've already eaten.<br/><br/>\nHow do you find surprises?  Well, therein lies half\nthe work of essay writing.  (The other half is expressing\nyourself well.)</font>   You can at least\n<font color=\"#aa0000\">use yourself as a\nproxy for the reader.  You should only write about things\nyou've thought about a lot.  And anything you come across\nthat surprises you, who've thought about the topic a lot,\nwill probably surprise most readers.<br/><br/>For example, in a recent essay I pointed out that because\nyou can only judge computer programmers by working with\nthem, no one knows</font> in programming who the heroes should\nbe.\n<font color=\"#aa0000\">I</font>\ncertainly\n<font color=\"#aa0000\">didn't realize this when I</font> started writing\nthe \n<font color=\"#aa0000\">essay, and even now I find it kind of weird.  That's\nwhat you're looking for.<br/><br/>So if you want to write essays, you need two ingredients:</font>\nyou need\n<font color=\"#aa0000\">a few topics that you think about a lot, and</font> you\nneed <font color=\"#aa0000\">some ability to ferret out the unexpected.<br/><br/>What should you think about?  My guess is that it\ndoesn't matter</font>.  Almost everything is\n<font color=\"#aa0000\">interesting if you get deeply\nenough into it.</font>  The <font color=\"#aa0000\">one possible exception</font>\nare\n<font color=\"#aa0000\">things\nlike working in fast food,</font> which\n<font color=\"#aa0000\">have deliberately had all\nthe variation sucked out of them</font>.\n<font color=\"#aa0000\">In retrospect, was there\nanything interesting about working in Baskin-Robbins?\nWell, it was interesting</font> to notice\n<font color=\"#aa0000\">how important color was\nto the customers.  Kids a certain age would point into\nthe case and say that they wanted yellow.  Did they want\nFrench Vanilla or Lemon?  They would just look at you\nblankly.  They wanted yellow.  And then there was the\nmystery of why the perennial favorite Pralines n' Cream\nwas so appealing. I</font>'m inclined now to\n<font color=\"#aa0000\">think it was the salt.</font>\nAnd the mystery of why Passion Fruit tasted so disgusting.\nPeople would order it because of the name, and were always\ndisappointed.  It should have been called In-sink-erator\nFruit.\n<font color=\"#aa0000\">And</font> there was\n<font color=\"#aa0000\">the difference in the way fathers and\nmothers bought ice cream for their kids</font>.\n<font color=\"#aa0000\">Fathers</font> tended to\nadopt the attitude of\n<font color=\"#aa0000\">benevolent kings bestowing largesse,</font>\nand <font color=\"#aa0000\">mothers</font> that of\n<font color=\"#aa0000\">harried</font> bureaucrats,\n<font color=\"#aa0000\">giving in to\npressure</font> against their better judgement.\n<font color=\"#aa0000\">So, yes, there does seem to be material, even in\nfast food.</font><br/><br/>What about the other half, ferreting out the unexpected?\nThat may require some natural ability.  I've noticed for\na long time that I'm pathologically observant.  ....<br/><br/>[That was as far as I'd gotten at the time.]<br/><br/><br/><br/><b>Notes</b><br/><br/>[sh] In Shakespeare's own time, serious writing meant theological\ndiscourses, not the bawdy plays acted over on the other  \nside of the river among the bear gardens and whorehouses.<br/><br/>The other extreme, the work that seems formidable from the moment\nit's created (indeed, is deliberately intended to be)\nis represented by Milton.  Like the Aeneid, Paradise Lost is a\nrock imitating a butterfly that happened to get fossilized.\nEven Samuel Johnson seems to have balked at this, on the one  \nhand paying Milton the compliment of an extensive biography,\nand on the other writing of Paradise Lost that \"none who read it\never wished it longer.\"<br/><br/><br/><br/><!-- <hr>\n<font color=#000000>That was as far as I'd gotten at the time.\nThe rest is a kind of midden that always accumulates at the\nend of the file, consisting of notes to myself\nand chunks of deleted text that I might (but never do) re-use later.<br /><br /><br /><br />These are the notes about what to work on the next morning.\n(The percent sign is the LaTex comment character.)\nExcept for the beginning, I didn't write about what I expected to:</font>\n<pre>\n% I didn't consciously notice the BR stuff at the time.\n% I'm noticing it now from raw memories.\n% naturalistic and weird: breugel\n% not allowed to write about painting\n% like nothing more than to be wrong-- because surprise\n% called opinionated, because I express opinions in ways\n%  that violate the usual social conventions, much as surgeons\n%  do things to your body that violate the usual social\n%  conventions.\n% but not opinionated in the sense that I won't change my\n%  opinions.  I love to be surprised, and to be surprised is\n%  always to have been at least implicitly mistaken   \n</pre><br /><br /><font color=#000000>\nThis is the part I had to discard when I backtracked.\nIt used to follow the paragraph that ended with\n\"prescribed course.\"</font><br /><br />Because you're after answers, instead of just trying to\nconvince people of something, it's important to qualify\nyour conclusions precisely.  No scientist will be satisfied\nto hear that you measured something and it was 12.7.\n12.7 plus or minus what?  What's your experimental error?<br /><br />This is just as important for questions whose answers\naren't numbers.\nAnd yet people rarely bother in ordinary\nconversation, most scientists included.  Once people\nswitch over to talking about matters that aren't\n\"scientific\"--- mere matters of opinion--- they pay\ncomparatively little attention to qualifying what they say.<br /><br />Oh, they <i>use</i> qualifiers.  Once kids\narrive in college they learn pretty quickly that proper\nintellectuals qualify every statement with \"perhaps\"\nor \"almost.\"  But this kind of qualification is nothing more\nthan grammatical. Sometimes these automatically inserted\nqualifications end up at odds with the statements they're\nattached to, yielding comic results.\nYou find people saying that a certain writer is\n\"perhaps the greatest writer of the twentieth century.\"\nThat's a rather strong way to put something you're not sure\nabout.  Wouldn't it be better just to say \"one of the best\nwriters of the twentieth century?\"<br /><br />One of the only people I've ever met who really pays attention\nto qualification is my friend Robert Morris.  His great\nfear in life is to say something that's mistaken.  So whenever   \nhe says something, he pays as much attention to expressing\nhow sure he is of it as he does to what he's saying.  He\nis a connoisseur of his own certainty, and has as many words\nfor expressing it as Eskimos have for snow.  This is how we\nall ought to be.  Sticking a perfunctory perhaps onto\nevery statement may shield us from blame, but it tells the\nreader nothing.  That's like the manufacturers of Q-Tips,\nwho to cover themselves print \"do not insert in ear canal\" on the\nboxes, when they know damned well that that's how Q-Tips are used.<br /><br />One of the most important things to know about\npainting is that darks make the light.  This is particularly\nobvious in watercolor.  Suppose you want to make a painting\nthat seems glowing with light.  Well, you can't get any\nbrighter than the white of the paper.  So the only way to\nmake the make the painting bright is to add darks\nthat make the lights seem brighter by contrast.  Without\ndarks, the painting won't seem bright; it will just seem\nwashed out.<br /><br />Some books about writing say that you shouldn't begin\nsentences with \"I think.\"  If you're saying something,\nthe argument does, then obviously you think it, so why\nbother telling people?  This is nonsense.  The heavily qualified\nstatements in an essay play the role of darks.  When you\nreach a point you're really sure of, you can just state it with no\nqualifications, and it will have all the more force by contrast.<br /><br />People aren't used to\nunqualified statements.  Without the automatic \"perhaps\"\nthey're used to seeing, many realize, with a shock,   \nthat what they're reading are <i>opinions.</i>\nWell of course.  And what essay consists of anything else?\nAn essay is not a theorem.\nYou don't have to say only things you can prove irrefutably.\nDon't be afraid of expressing your opinions.  Just make sure\nyou're right.<br /><br /><br /><br /><font color=#000000>\nMiscellaneous smaller cuts:</font><br /><br />The downside is that essays may contain mistakes (though\nso can theorems).  The upside is that you can talk about<br /><br />more things.<br /><br />The world is not divided into the \"scientific\" and the\n\"subjective.\"  Scientific is a matter of degree.  And there\nare plenty of questions that would be impractical to\nanswer by a controlled experiment and yet which are\nworth discussing.  Indeed, some of the most interesting\nquestions are of this type.<br /><br />To mathematicians, the work of physicists seems rather\nspeculative.<br /><br />But if they're less precise, they can talk about a broader\nrange of subjects.<br /><br />Sometimes I feel tempted to\nadd a disclaimer to the beginning of my essays saying,\nif you're bothered by unqualified statements, just stick  \nthe \"perhaps\" that you're used to seeing before each one.\nI mean the same thing.<br /><br />Don't expect people to thank you for delivering these  \nvaluable facts to them, though---any more than they would\nthank you for giving them steamed vegetables for dinner.<br /><br /><br /><br /><font color=#000000>\nMore notes about topics I intended to cover:</font>\n<pre>\n% people will get angry, accuse you of making unsupported statements\n% mere opinions\n%  as if problem was structure, not content\n% whole question of qualification, support\n% all the good writers seem to be english\n% practically the algorithm for life: look for anomalies\n% actually start the one about the role of color in fashion \n% try to write sound bites\n% length kind of arbitrary, based on human reader,\n%  not needs of topic\n</pre><font color=#000000><br /><br />And more cut text:</font><br /><br />I don't know O'Reilly's street address,\nbut it's probably not going to surprise me.  Surprises are<br /><br />What's so important about surprises?  They're the truth\nyou didn't already know.<br /><br />An essay must at least explore conclusions, even if\nthis offends people.  And the disconcerting thing is,\nmerely exploring ideas does offend people.\nReaders used to defend-a-position\nwriting tend to get as angry with you for saying\n\"let's explore the possibility that x\" as if you had\nsaid \"I believe x.\"  Indeed, some writers use the former\nas nothing more than a learned sounding replacement for\nthe latter.  But in a proper essay,<br /><br />But when I want to say x I just say it.<br /><br />That sort of thing isn't really an essay either, though\nit begins like one.<br /><br />I'm too afraid of real live readers to pull that sort of\nthing.<br /><br />fuzzy treatments of controversial topics\nthat begin with interesting questions, retreat in terror\nfrom the<br /><br />nature of newsmagazines means that such essays always start\nwith the most controversial questions.<br /><br />Real live readers won't stand for this.   In fact, they're\noften made to stand for it.  I've noticed plenty of \"essays\"\nthat peter out in this way.<br /><br />Their resistance\ngives the essay half its shape.<br /><br />Writing well is an extremely valuable skill.  In part\nbecause to do it you have to think well.<br /><br />By the late 19th century, the era in which the study of ancient\ntexts had been the hottest area of scholarship was a\ndistant memory.  But the classics still had enormous prestige.\nThe problems posed by the ancientness part had been mostly\nsolved, or solved as well as they were going to be.  And so\nwhat was left<br /><br />the people doing it hardly\nremembered why it had originally been done.<br /><br />We think of the classics as tidy little red and green volumes\nfrom the Loeb Library.<br /><br />From Islamic civilizations,\nwhich were at that time far ahead in matters of scholarship,\nthey got Plato, Aristotle, Euclid, Ptolemy.\ndifferent Europe: what entered in 500 was the rump of the\nwestern Roman empire, and what emerged in 1000 was a\ncivilization centered as much in northern Europe as in\nItaly.<br /><br />misleading to talk about \"Europe\"<br /><br />From this\nperiod date the oldest surviving institutions<br /><br />because university admissions were\nlimited to children whose parents were willing to pay for them\nto spend ten years studying ancient languages.<br /><br />(I'm not saying that new disciplines have no content.\nI'm just saying that that isn't necessary.)<br /><br /><br /><br /><font color=#000000>\nThese appear to the the original notes I started with.  \nI don't usually write more than this before I start. \nI never got to half the topics I meant to cover,\nbecause the focus switched from prose to ideas.</font>\n<pre>\n%friend liked\n%why about novels?\n%imagine if aliens showed up.\n%If you feel like what you're doing is pointless, you're right.\n%took an english course in college and was so disgusted I\n%  never took another\n%Big diff is essays are about figuring things out, not\n% choosing a position and arguing it like a lawyer.\n%don't learn hardest thing, which is to cut\n%waugh test\n%read aloud\n%mark uncomfortable bits\n%stitch sentences together\n%rhythm\n</pre>\n</font>\n--><br/><br/></font></font>","date":"2004-10-01T00:00:00Z"}