{"href":"name.html","title":"Change Your Name","content":"<font face=\"verdana\" size=\"2\">August 2015<br/><br/>If you have a US startup called X and you don't have x.com, you\nshould probably change your name.<br/><br/>The reason is not just that people can't find you.  For companies\nwith mobile apps, especially, having the right domain name is not\nas critical as it used to be for getting users.  The problem with\nnot having the .com of your name is that it signals weakness.  Unless\nyou're so big that your reputation precedes you, a marginal domain\nsuggests you're a marginal company.  Whereas\n(as <xa href=\"http://stripe.com\">Stripe shows)\nhaving x.com signals strength even if it has no relation to what you\ndo.<br/><br/>Even good founders can be in denial about this.  Their denial derives\nfrom two very powerful forces: identity, and lack of imagination.<br/><br/>X is what we <i>are</i>, founders think. There's no other name as good.\nBoth of which are false.<br/><br/>You can fix the first by stepping back from the problem. Imagine\nyou'd called your company something else.  If you had, surely you'd\nbe just as attached to that name as you are to your current one.\nThe idea of switching to your current name would seem repellent.\n<font color=\"#999999\">[<a href=\"#f1n\"><font color=\"#999999\">1</font></a>]</font><br/><br/>There's nothing intrinsically great about your current name.  Nearly\nall your attachment to it comes from it being attached to you.\n<font color=\"#999999\">[<a href=\"#f1n\"><font color=\"#999999\">2</font></a>]</font><br/><br/>The way to neutralize the second source of denial, your inability\nto think of other potential names, is to acknowledge that you're\nbad at naming.  Naming is a completely separate skill from those\nyou need to be a good founder.  You can be a great startup founder\nbut hopeless at thinking of names for your company.<br/><br/>Once you acknowledge that, you stop believing there is nothing else\nyou could be called.  There are lots of other potential names that\nare as good or better; you just can't think of them.<br/><br/>How do you find them? One answer is the default way to solve\nproblems you're bad at: find someone else who can think of names.\nBut with company names there is another possible\napproach.  It turns out almost any word or word pair that is not\nan obviously bad name is a sufficiently good one, and the number\nof such domains is so large that you can find plenty that are cheap\nor even untaken.  So make a list and try to buy some.  That's what\n<a href=\"http://www.quora.com/How-did-Stripe-come-up-with-its-name?share=1\">Stripe</a> \ndid.  (Their search also turned up parse.com, which their\nfriends at Parse took.)<br/><br/>The reason I know that naming companies is a distinct skill orthogonal\nto the others you need in a startup is that I happen to have it.\nBack when I was running YC and did more office hours with startups,\nI would often help them find new names.  80% of the time we could\nfind at least one good name in a 20 minute office hour slot.<br/><br/>Now when I do office hours I have to focus on more important\nquestions, like what the company is doing.  I tell them when they\nneed to change their name.  But I know the power of the forces that\nhave them in their grip, so I know most won't listen. \n<font color=\"#999999\">[<a href=\"#f1n\"><font color=\"#999999\">3</font></a>]</font><br/><br/>There are of course examples of startups that have succeeded without\nhaving the .com of their name.  There are startups that have succeeded despite any\nnumber of different mistakes.  But this mistake is less excusable\nthan most.  It's something that can be fixed in a couple days if\nyou have sufficient discipline to acknowledge the problem.<br/><br/>100% of the top 20 YC companies by valuation have the .com of their\nname. 94% of the top 50 do. But only 66% of companies in the current\nbatch have the .com of their name. Which suggests there are lessons\nahead for most of the rest, one way or another.<br/><br/><br/><br/><br/><br/>\n<b>Notes</b><br/><br/>[<a name=\"f1n\"><font color=\"#000000\">1</font></a>]\nIncidentally, this thought experiment works for\n<a href=\"identity.html\">nationality and religion</a> too.<br/><br/>[<a name=\"f2n\"><font color=\"#000000\">2</font></a>]\nThe liking you have for a name that has become part of your\nidentity manifests itself not directly, which would be easy to\ndiscount, but as a collection of specious beliefs about its intrinsic\nqualities.  (This too is true of nationality and religion as well.)<br/><br/>[<a name=\"f3n\"><font color=\"#000000\">3</font></a>]\nSometimes founders know it's a problem that they don't have\nthe .com of their name, but delusion strikes a step later in the belief that they'll\nbe able to buy it despite having no evidence it's for sale.  Don't\nbelieve a domain is for sale unless the owner has already told you\nan asking price.<br/><br/>\n<b>Thanks</b> to Sam Altman, Jessica Livingston, and Geoff Ralston\nfor reading drafts of this.<br/><br/></xa></font>","date":"2015-08-01T00:00:00Z"}