{"href":"nov.html","title":"Novelty and Heresy","content":"<font face=\"verdana\" size=\"2\">November 2019<br/><br/>If you discover something new, there's a significant chance you'll be\naccused of some form of heresy.<br/><br/>To discover new things, you have\nto work on ideas that are good but non-obvious; if an idea is\nobviously good, other people are probably already working on it.\nOne common way for a good idea to be non-obvious is for it to be hidden in the\nshadow of some mistaken assumption that people are very attached to.\nBut anything you discover from working on such an idea will tend to\ncontradict the mistaken assumption that was concealing it.  And you\nwill thus get a lot of heat from people attached to the mistaken\nassumption. Galileo and Darwin are famous examples of this phenomenon,\nbut it's probably always an ingredient in the resistance to new\nideas.<br/><br/>So it's particularly dangerous for an organization or society to\nhave a culture of pouncing on heresy.  When you suppress heresies,\nyou don't just prevent people from contradicting the mistaken\nassumption you're trying to protect. You also suppress any idea\nthat implies indirectly that it's false.\n<!--\nWhen you suppress heresy, you silence not just your opponents but\nalso everyone who contradicts you unintentionally.  And because\nideas are so interconnected, you're almost certainly silencing more\npeople than you realize. \n--><br/><br/>Every cherished mistaken assumption has\na dead zone of unexplored ideas around it.  And the more preposterous\nthe assumption, the bigger the dead zone it creates.<br/><br/>There is a positive side to this phenomenon though.  If you're\nlooking for new ideas, one way to find them is by <a href=\"https://paulgraham.com/say.html\"><u>looking for\nheresies</u></a>.  When you look at the question this way, the depressingly\nlarge dead zones around mistaken assumptions become excitingly large\nmines of new ideas.<br/><br/><br/><br/><br/><br/></font>","date":"2019-11-01T00:00:00Z"}