{"href":"orth.html","title":"Orthodox Privilege","content":"<font face=\"verdana\" size=\"2\">July 2020<br/><br/><table cellpadding=\"6\" cellspacing=\"0\" width=\"100%\">\n<tr><td bgcolor=\"#ffffdd\">\n<table cellpadding=\"0\" cellspacing=\"0\" width=\"100%\">\n<tr><td bgcolor=\"#ffffdd\"><font size=\"2\">\r\n\"Few people are capable of expressing with equanimity opinions which differ from the prejudices of their social environment. Most people are even incapable of forming such opinions.\"<br/><br/> Einstein\r\n</font>\n</td></tr></table>\n</td></tr></table><br/><br/>\nThere has been a lot of talk about privilege lately. Although the\r\nconcept is overused, there is something to it, and in particular\r\nto the idea that privilege makes you blind  that you can't see\r\nthings that are visible to someone whose life is very different\r\nfrom yours.<br/><br/>But one of the most pervasive examples of this kind of blindness\r\nis one that I haven't seen mentioned explicitly. I'm going to call\r\nit <i>orthodox privilege</i>: The more conventional-minded someone is, the\r\nmore it seems to them that it's safe for everyone to express their\r\nopinions.<br/><br/>It's safe for <i>them</i> to express their opinions, because the source\r\nof their opinions is whatever it's currently acceptable to believe.\r\nSo it seems to them that it must be safe for everyone. They literally\r\ncan't imagine a true statement that would get you in trouble.<br/><br/>And yet at every point in history, there <a href=\"say.html\"><u>were</u></a>\r\ntrue things that would\r\nget you in trouble to say. \r\nIs ours the first where this\r\nisn't so? What an amazing coincidence that would be.<br/><br/>Surely it should at least be the default assumption that our time\r\nis not unique, and that there are true things you can't say now,\r\njust as there have always been. You would think. But even in the\r\nface of such overwhelming historical evidence, most people will go\r\nwith their gut on this one.<br/><br/>In the most extreme cases, people suffering from orthodox\r\nprivilege will not only deny that there's anything true that \r\nyou can't say, but will accuse you of heresy merely for saying there is. \r\nThough if there's more than one heresy current in\r\nyour time, these accusations will be weirdly non-deterministic:\r\nyou must either be an xist or a yist.<br/><br/>Frustrating as it is to deal with these people, it's important to\r\nrealize that they're in earnest. They're not pretending they think\r\nit's impossible for an idea to be both unorthodox and true. The\r\nworld really looks that way to them.<br/><br/>Indeed, this is a uniquely tenacious form of privilege. People can\r\novercome the blindness induced by most forms of privilege by learning\r\nmore about whatever they're not. But they can't overcome orthodox\r\nprivilege just by learning more. They'd have to become more\r\nindependent-minded. If that happens at all, it doesn't happen on\r\nthe time scale of one conversation.<br/><br/>It may be possible to convince some people that orthodox privilege\r\nmust exist even though they can't sense it, just as one can with,\r\nsay, dark matter. There may be some who could be convinced, for\r\nexample, that it's very unlikely that this is the first point in\r\nhistory at which there's nothing true you can't say, even if they\r\ncan't imagine specific examples.<br/><br/>But in general I don't think it will work to say\r\n\"check your privilege\" about this type of privilege, because those\r\nin its demographic don't realize they're in it. It doesn't seem to\r\nconventional-minded people that they're conventional-minded. It\r\njust seems to them that they're right. Indeed, they tend to be\r\nparticularly sure of it.<br/><br/>Perhaps the solution is to appeal to politeness. If someone says\r\nthey can hear a high-pitched noise that you can't, it's only polite\r\nto take them at their word, instead of demanding evidence that's\r\nimpossible to produce, or simply denying that they hear anything.\r\nImagine how rude that would seem. Similarly, if someone says they\r\ncan think of things that are true but that cannot be said, it's\r\nonly polite to take them at their word, even if you can't think of\r\nany yourself.\r\n<!--\r\nOnce you realize that orthodox privilege exists, a lot of other\r\nthings become clearer. For example, how can it be that a large\r\nnumber of reasonable, intelligent people worry about something they\r\ncall \"cancel culture,\" while other reasonable, intelligent people\r\ndeny that it's a problem? Once you understand the concept of orthodox\r\nprivilege, it's easy to see the source of this disagreement.  If\r\nyou believe there's nothing true that you can't say, then anyone\r\nwho gets in trouble for something they say must deserve it. --><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><b>Thanks</b> to Sam Altman, Trevor Blackwell, Patrick Collison, Antonio Garcia-Martinez,\r\nJessica Livingston, Robert Morris, Michael Nielsen, Geoff Ralston, Max Roser, and\r\nHarj Taggar for reading drafts of this.<br/><br/></font>","date":"2020-07-01T00:00:00Z"}