{"href":"pinch.html","title":"The Fatal Pinch","content":"<font face=\"verdana\" size=\"2\">December 2014<br/><br/>Many startups go through a point a few months before they die where\nalthough they have a significant amount of money in the bank, they're\nalso losing a lot each month, and revenue growth is either nonexistent\nor mediocre.  The company has, say, 6 months of runway.  Or to put\nit more brutally, 6 months before they're out of business.  They\nexpect to avoid that by raising more from investors.\n<font color=\"#999999\">[<a href=\"https://paulgraham.com/pinch.html#f1n\"><font color=\"#999999\">1</font></a>]</font><br/><br/>That last sentence is the fatal one.<br/><br/>There may be nothing founders are so prone to delude themselves\nabout as how interested investors will be in giving them additional\nfunding.  It's hard to convince investors the first time too, but\nfounders expect that.  What bites them the second time is a confluence\nof three forces:\n<ol>\n<li> The company is spending more now than it did the first time\n  it raised money.<br/><br/><li> Investors have much higher standards for companies that have\n  already raised money.<br/><br/><li> The company is now starting to read as a failure. The first\n  time it raised money, it was neither a success nor a failure; it\n  was too early to ask. Now it's possible to ask that question, and\n  the default answer is failure, because at this point that is the\n  default outcome.\n</li></li></li></ol>\nI'm going to call the situation I described in the first paragraph \"the fatal pinch.\" I try to resist\ncoining phrases, but making up a name for this situation may snap\nfounders into realizing when they're in it.<br/><br/>One of the things that makes the fatal pinch so dangerous is\nthat it's self-reinforcing.  Founders overestimate their chances\nof raising more money, and so are slack about reaching\nprofitability, which further decreases their chances of raising\nmoney.<br/><br/>Now that you know about the fatal pinch, how do you avoid it?  Y Combinator tells\nfounders who raise money to act as if it's the last they'll ever\nget.  Because the self-reinforcing nature of this situation works\nthe other way too: the less you need further investment, the easier\nit is to get.<br/><br/>What do you do if you're already in the fatal pinch?  The\nfirst step is to re-evaluate the probability of raising more money.\nI will now, by an amazing feat of clairvoyance, do this for you:\nthe probability is zero. \n<font color=\"#999999\">[<a href=\"https://paulgraham.com/pinch.html#f2n\"><font color=\"#999999\">2</font></a>]</font><br/><br/>Three options remain: you can shut down the company, you can increase\nhow much you make, and you can decrease how much you spend.<br/><br/>You should shut down the company if you're certain it will\nfail no matter what you do.  Then at least you can give back the\nmoney you have left, and save yourself however many months you would\nhave spent riding it down.<br/><br/>Companies rarely <i>have</i> to fail though.  What I'm really doing\nhere is giving you the option of admitting you've already given up.<br/><br/>If you don't want to shut down the company, that leaves increasing\nrevenues and decreasing expenses.  In most startups, expenses =\npeople, and decreasing expenses = firing people.\n<font color=\"#999999\">[<a href=\"https://paulgraham.com/pinch.html#f3n\"><font color=\"#999999\">3</font></a>]</font>\nDeciding to\nfire people is usually hard, but there's one case in which it\nshouldn't be: when there are people you already know you should\nfire but you're in denial about it.  If so, now's the time.<br/><br/>If that makes you profitable, or will enable you to make it to\nprofitability on the money you have left, you've avoided the immediate\ndanger.<br/><br/>Otherwise you have three options: you either have to fire good\npeople, get some or all of the employees to take less salary for a\nwhile, or increase revenues.<br/><br/>Getting people to take less salary is a weak solution that will\nonly work when the problem isn't too bad.  If your current trajectory\nwon't quite get you to profitability but you can get over the threshold\nby cutting salaries a little,\nyou might be able to make the case to everyone for doing it.\nOtherwise you're probably just postponing the problem, and that\nwill be obvious to the people whose salaries you're proposing to\ncut.\n<font color=\"#999999\">[<a href=\"https://paulgraham.com/pinch.html#f4n\"><font color=\"#999999\">4</font></a>]</font><br/><br/>Which leaves two options, firing good people and making more money.\nWhile trying to balance them, keep in mind the eventual goal: to be\na successful product company in the sense of having a single thing\nlots of people use.<br/><br/>You should lean more toward firing people if the source of your\ntrouble is overhiring. If you went out and hired 15 people before\nyou even knew what you were building, you've created a broken\ncompany.  You need to figure out what you're building, and it will\nprobably be easier to do that with a handful of people than 15.\nPlus those 15 people might not even be the ones you need for whatever\nyou end up building.  So the solution may be to shrink and then\nfigure out what direction to grow in.  After all, you're not doing\nthose 15 people any favors if you fly the company into ground with\nthem aboard.  They'll all lose their jobs eventually, along with\nall the time they expended on this doomed company.<br/><br/>Whereas if you only have a handful of people, it may be better to\nfocus on trying to make more money.  It may seem facile to suggest\na startup make more money, as if that could be done for the asking.\nUsually a startup is already trying as hard as it can to sell\nwhatever it sells.  What I'm suggesting here is not so much to try\nharder to make money but to try to make money in a different way.\nFor example, if you have only one person selling while the rest are\nwriting code, consider having everyone work on selling.  What good\nwill more code do you when you're out of business?  \nIf you have to write code to close a certain deal, go ahead;\nthat follows from everyone working on selling.  But only work on\nwhatever will get you the most revenue the soonest.<br/><br/>Another way to make money differently is to sell different things,\nand in particular to do more consultingish work.  I say consultingish\nbecause there is a long slippery slope from making products to pure\nconsulting, and you don't have to go far down it before you start\nto offer something really attractive to customers. Although your\nproduct may not be very appealing yet, if you're a startup your\nprogrammers will often be way better than the ones your customers\nhave.  Or you may have expertise in some new field they\ndon't understand.  So if you change your sales conversations\njust a little from \"do you want to buy our product?\" to \"what do\nyou need that you'd pay a lot for?\" you may find it's suddenly a\nlot easier to extract money from customers.<br/><br/>Be ruthlessly mercenary when you start doing this, though. You're\ntrying to save your company from death here, so make customers pay\na lot, quickly. And to the extent you can, try to avoid the\nworst pitfalls of consulting.  The ideal thing might be if you built\na precisely defined derivative version of your product for the\ncustomer, and it was otherwise a straight product sale.  You keep\nthe IP and no billing by the hour.<br/><br/>In the best case, this consultingish work may not be just something\nyou do to survive, but may turn out to be the <a href=\"https://paulgraham.com/ds.html\">thing-that-doesn't-scale</a> that defines your\ncompany.  Don't expect it to be, but as you dive into individual\nusers' needs, keep your eyes open for narrow openings that have\nwide vistas beyond.<br/><br/>There is usually so much demand for custom work that unless you're\nreally incompetent there has to be some point down the slope of\nconsulting at which you can survive.  But I didn't use the term\nslippery slope by accident; customers' insatiable demand for custom\nwork will always be pushing you toward the bottom.  So while you'll\nprobably survive, the problem now becomes to survive with the least\ndamage and distraction.<br/><br/>The good news is, plenty of successful startups have passed through\nnear-death experiences and gone on to flourish.  You just have to\nrealize in time that you're near death.  And if you're in the fatal pinch,\nyou are.<br/><br/><br/><br/><br/><br/>\n<b>Notes</b><br/><br/>[<a name=\"f1n\"><font color=\"#000000\">1</font></a>]\nThere are a handful of companies that can't reasonably expect\nto make money for the first year or two, because what they're\nbuilding takes so long.  For these companies substitute \"progress\"\nfor \"revenue growth.\"  You're not one of these companies unless\nyour initial investors agreed in advance that you were.  And frankly\neven these companies wish they weren't, because the illiquidity of\n\"progress\" puts them at the mercy of investors.<br/><br/>[<a name=\"f2n\"><font color=\"#000000\">2</font></a>]\nThere's a variant of the fatal pinch where your existing\ninvestors help you along by promising to invest more.  Or rather,\nwhere you read them as promising to invest more, while they think\nthey're just mentioning the possibility.  The way to solve this\nproblem, if you have 8 months of runway or less, is to try to get\nthe money right now.  Then you'll either get the money, in which\ncase (immediate) problem solved, or at least prevent your investors\nfrom helping you to remain in denial about your fundraising prospects.<br/><br/>[<a name=\"f3n\"><font color=\"#000000\">3</font></a>]\nObviously, if you have significant expenses other than salaries\nthat you can eliminate, do it now.<br/><br/>[<a name=\"f4n\"><font color=\"#000000\">4</font></a>]\nUnless of course the source of the problem is that you're paying\nyourselves high salaries.  If by cutting the founders' salaries to\nthe minimum you need, you can make it to profitability, you should.\nBut it's a bad sign if you needed to read this to realize that.<br/><br/>\n<b>Thanks</b> to Sam Altman, Paul Buchheit, Jessica Livingston, and\nGeoff Ralston for reading drafts of this.<br/><br/></font>","date":"2014-12-01T00:00:00Z"}