{"href":"relres.html","title":"Relentlessly Resourceful","content":"<font face=\"verdana\" size=\"2\"><table cellspacing=\"0\" width=\"100%\">\n<tr><td bgcolor=\"#ff9922\"><img height=\"15\" src=\"http://www.virtumundo.com/images/spacer.gif\" width=\"1\"/><font size=\"2\">\n<b>Want to start a startup?</b>  Get funded by\r\n<a href=\"http://ycombinator.com/apply.html\">Y Combinator</a>.\r\n</font>\n<br/><img height=\"5\" src=\"http://www.virtumundo.com/images/spacer.gif\" width=\"1\"/></td></tr>\n</table>\n<p>\r\nMarch 2009<br><br/>A couple days ago I finally got being a good startup founder down\r\nto two words:  relentlessly resourceful.<br/><br/>Till then the best I'd managed was to get the opposite quality down\r\nto one: hapless.  Most dictionaries say hapless means unlucky.  But\r\nthe dictionaries are not doing a very good job.  A team that outplays\r\nits opponents but loses because of a bad decision by the referee\r\ncould be called unlucky, but not hapless.  Hapless implies passivity.\r\nTo be hapless is to be battered by circumstances — to let the world\r\nhave its way with you, instead of having your way with the world.\r\n<!--Unlucky is a bad synonym, because it emphasizes the role of chance\r\nin bad outcomes.  Hapless overlaps more with the other component\r\nof bad outcomes, the half that makes them deserved. -->\n<font color=\"#999999\">[<a href=\"#f1n\"><font color=\"#999999\">1</font></a>]</font><br/><br/>Unfortunately there's no antonym of hapless, which makes it difficult\r\nto tell founders what to aim for.  \"Don't be hapless\" is not much\r\nof a rallying cry.<br/><br/>It's not hard to express the quality we're looking for in metaphors.\r\nThe best is probably a running back.  A good running back is not\r\nmerely determined, but flexible as well.  They want to get downfield,\r\nbut they adapt their plans on the fly.<br/><br/>Unfortunately this is just a metaphor, and not a useful one to most\r\npeople outside the US.   \"Be like a running back\" is no better than\r\n\"Don't be hapless.\"<br/><br/>But finally I've figured out how to express this quality directly.\r\nI was writing a talk for \r\n<a href=\"angelinvesting.html\">investors</a>, and I had to explain what to\r\nlook for in founders.  What would someone who was the opposite of\r\nhapless be like?  They'd be relentlessly resourceful.  Not merely\r\nrelentless.  That's not enough to make things go your way except\r\nin a few mostly uninteresting domains.  In any interesting domain,\r\nthe difficulties will be novel.  Which means you can't simply plow\r\nthrough them, because you don't know initially how hard they are;\r\nyou don't know whether you're about to plow through a block of foam\r\nor granite.  So you have to be resourceful. You have to keep\r\ntrying new things.<br/><br/>Be relentlessly resourceful.<br/><br/>That sounds right, but is it simply a description\r\nof how to be successful in general?  I don't think so.  This isn't\r\nthe recipe for success in writing or painting, for example.  In\r\nthat kind of work the recipe is more to be actively curious.\r\nResourceful implies the obstacles are external, which they generally\r\nare in startups. But in writing and painting they're mostly internal;\r\nthe obstacle is your own obtuseness.\r\n<font color=\"#999999\">[<a href=\"#f2n\"><font color=\"#999999\">2</font></a>]</font><br/><br/>There probably are other fields where \"relentlessly resourceful\"\r\nis the recipe for success.  But though other fields may share it,\r\nI think this is the best short description we'll find of what makes\r\na good startup founder.  I doubt it could be made more precise.<br/><br/>Now that we know what we're looking for, that leads to other\r\nquestions.  For example, can this quality be taught?  After four\r\nyears of trying to teach it to people, I'd say that yes, surprisingly\r\noften it can.  Not to everyone, but to many people. \r\n<font color=\"#999999\">[<a href=\"#f3n\"><font color=\"#999999\">3</font></a>]</font>\r\nSome\r\npeople are just constitutionally passive, but others have a latent\r\nability to be relentlessly resourceful that only needs to be brought\r\nout.<br/><br/>This is particularly true of young people who have till now always\r\nbeen under the thumb of some kind of authority.  Being relentlessly\r\nresourceful is definitely not the recipe for success in big companies,\r\nor in most schools.  I don't even want to think what the recipe is\r\nin big companies, but it is certainly longer and messier, involving\r\nsome combination of resourcefulness, obedience, and building\r\nalliances.<br/><br/>Identifying this quality also brings us closer to answering a\r\nquestion people often wonder about: how many startups there could\r\nbe.  There is not, as some people seem to think, any economic upper\r\nbound on this number.  There's no reason to believe there is any\r\nlimit on the amount of newly created wealth consumers can absorb,\r\nany more than there is a limit on the number of theorems that can\r\nbe proven.  So probably the limiting factor on the number of startups\r\nis the pool of potential founders.  Some people would make good\r\nfounders, and others wouldn't.  And now that we can say what makes\r\na good founder, we know how to put an upper bound on the size of\r\nthe pool.<br/><br/>This test is also useful to individuals.  If you want to know whether\r\nyou're the right sort of person to start a startup, ask yourself\r\nwhether you're relentlessly resourceful.  And if you want to know\r\nwhether to recruit someone as a cofounder, ask if they are.<br/><br/>You can even use it tactically.  If I were running a startup, this\r\nwould be the phrase I'd tape to the mirror.  \"Make something people\r\nwant\" is the destination, but \"Be relentlessly resourceful\" is how\r\nyou get there.<br/><br/><br/><br/><br/><br/><br/><br/>\n<b>Notes</b><br/><br/>[<a name=\"f1n\"><font color=\"#000000\">1</font></a>]\r\nI think the reason the dictionaries are wrong is that the\r\nmeaning of the word has shifted.  No one writing a dictionary from\r\nscratch today would say that hapless meant unlucky.  But a couple\r\nhundred years ago they might have.  People were more at the mercy\r\nof circumstances in the past, and as a result a lot of the words\r\nwe use for good and bad outcomes have origins in words about luck.<br/><br/>When I was living in Italy, I was once trying to tell someone\r\nthat I hadn't had much success in doing something, but I couldn't\r\nthink of the Italian word for success.  I spent some time trying\r\nto describe the word I meant.  Finally she said \"Ah! Fortuna!\"<br/><br/>[<a name=\"f2n\"><font color=\"#000000\">2</font></a>]\r\nThere are aspects of startups where the recipe is to be\r\nactively curious.  There can be times when what you're doing is\r\nalmost pure discovery.  Unfortunately these times are a small\r\nproportion of the whole.  On the other hand, they are in research\r\ntoo.<br/><br/>[<a name=\"f3n\"><font color=\"#000000\">3</font></a>]\r\nI'd almost say to most people, but I realize (a) I have no\r\nidea what most people are like, and (b) I'm pathologically optimistic\r\nabout people's ability to change.<br/><br/><b>Thanks</b> to Trevor Blackwell and Jessica Livingston for reading drafts\r\nof this.<br/><br/></br></p></font>","date":"2009-03-01T00:00:00Z"}