{"href":"richnow.html","title":"How People Get Rich Now","content":"<font face=\"verdana\" size=\"2\">April 2021<br/><br/>Every year since 1982, <i>Forbes</i> magazine has published a list of the\r\nrichest Americans. If we compare the 100 richest people in 1982 to\r\nthe 100 richest in 2020, we notice some big differences.<br/><br/>In 1982 the most common source of wealth was inheritance. Of the\r\n100 richest people, 60 inherited from an ancestor. There were 10\r\ndu Pont heirs alone. By 2020 the number of heirs had been cut in\r\nhalf, accounting for only 27 of the biggest 100 fortunes.<br/><br/>Why would the percentage of heirs decrease? Not because inheritance\r\ntaxes increased. In fact, they decreased significantly during this\r\nperiod. The reason the percentage of heirs has decreased is not\r\nthat fewer people are inheriting great fortunes, but that more\r\npeople are making them.<br/><br/>How are people making these new fortunes? Roughly 3/4 by starting\r\ncompanies and 1/4 by investing. Of the 73 new fortunes in 2020, 56\r\nderive from founders' or early employees' equity (52 founders, 2\r\nearly employees, and 2 wives of founders), and 17 from managing\r\ninvestment funds.<br/><br/>There were no fund managers among the 100 richest Americans in 1982.\r\nHedge funds and private equity firms existed in 1982, but none of\r\ntheir founders were rich enough yet to make it into the top 100.\r\nTwo things changed: fund managers discovered new ways to generate\r\nhigh returns, and more investors were willing to trust them with\r\ntheir money.\r\n<font color=\"#dddddd\">[<a href=\"#f1n\"><font color=\"#dddddd\">1</font></a>]</font><br/><br/>But the main source of new fortunes now is starting companies, and\r\nwhen you look at the data, you see big changes there too. People\r\nget richer from starting companies now than they did in 1982, because\r\nthe companies do different things.<br/><br/>In 1982, there were two dominant sources of new wealth: oil and\r\nreal estate. Of the 40 new fortunes in 1982, at least 24 were due\r\nprimarily to oil or real estate. Now only a small number are: of\r\nthe 73 new fortunes in 2020, 4 were due to real estate and only 2\r\nto oil.<br/><br/>By 2020 the biggest source of new wealth was what are sometimes\r\ncalled \"tech\" companies. Of the 73 new fortunes, about 30 derive\r\nfrom such companies. These are particularly common among the richest\r\nof the rich: 8 of the top 10 fortunes in 2020 were new fortunes of\r\nthis type.<br/><br/>Arguably it's slightly misleading to treat tech as a category.\r\nIsn't Amazon really a retailer, and Tesla a car maker? Yes and no.\r\nMaybe in 50 years, when what we call tech is taken for granted, it\r\nwon't seem right to put these two businesses in the same category.\r\nBut at the moment at least, there is definitely something they share\r\nin common that distinguishes them. What retailer starts AWS? What\r\ncar maker is run by someone who also has a rocket company?<br/><br/>The tech companies behind the top 100 fortunes also form a\r\nwell-differentiated group in the sense that they're all companies\r\nthat venture capitalists would readily invest in, and the others\r\nmostly not. And there's a reason why: these are mostly companies\r\nthat win by having better technology, rather than just a CEO who's\r\nreally driven and good at making deals.<br/><br/>To that extent, the rise of the tech companies represents a qualitative\r\nchange. The oil and real estate magnates of the 1982 Forbes 400\r\ndidn't win by making better technology. They won by being really\r\ndriven and good at making deals. \r\n<font color=\"#dddddd\">[<a href=\"#f2n\"><font color=\"#dddddd\">2</font></a>]</font>\r\nAnd indeed, that way of\r\ngetting rich is so old that it predates the Industrial Revolution.\r\nThe courtiers who got rich in the (nominal) service of European\r\nroyal houses in the 16th and 17th centuries were also, as a rule,\r\nreally driven and good at making deals.<br/><br/>People who don't look any deeper than the Gini coefficient look\r\nback on the world of 1982 as the good old days, because those who\r\ngot rich then didn't get as rich. But if you dig into <i>how</i> they\r\ngot rich, the old days don't look so good. In 1982, 84% of the\r\nrichest 100 people got rich by inheritance, extracting natural\r\nresources, or doing real estate deals. Is that really better than\r\na world in which the richest people get rich by starting tech\r\ncompanies?<br/><br/>Why are people starting so many more new companies than they used\r\nto, and why are they getting so rich from it? The answer to the\r\nfirst question, curiously enough, is that it's misphrased. We\r\nshouldn't be asking why people are starting companies, but why\r\nthey're starting companies <i>again</i>.\r\n<font color=\"#dddddd\">[<a href=\"#f3n\"><font color=\"#dddddd\">3</font></a>]</font><br/><br/>In 1892, the <i>New York Herald Tribune</i> compiled a list of all the\r\nmillionaires in America. They found 4047 of them. How many had\r\ninherited their wealth then? Only about 20%, which is less than the\r\nproportion of heirs today. And when you investigate the sources of\r\nthe new fortunes, 1892 looks even more like today. Hugh Rockoff\r\nfound that \"many of the richest ... gained their initial edge from\r\nthe new technology of mass production.\"\r\n<font color=\"#dddddd\">[<a href=\"#f4n\"><font color=\"#dddddd\">4</font></a>]</font><br/><br/>So it's not 2020 that's the anomaly here, but 1982. The real question\r\nis why so few people had gotten rich from starting companies in\r\n1982. And the answer is that even as the <i>Herald Tribune</i>'s list was\r\nbeing compiled, a wave of <a href=\"re.html\"><u>consolidation</u></a> \r\nwas sweeping through the\r\nAmerican economy. In the late 19th and early 20th centuries,\r\nfinanciers like J. P. Morgan combined thousands of smaller companies\r\ninto a few hundred giant ones with commanding economies of scale.\r\nBy the end of World War II, as Michael Lind writes, \"the major\r\nsectors of the economy were either organized as government-backed\r\ncartels or dominated by a few oligopolistic corporations.\"\r\n<font color=\"#dddddd\">[<a href=\"#f5n\"><font color=\"#dddddd\">5</font></a>]</font><br/><br/>In 1960, most of the people who start startups today would have\r\ngone to work for one of them. You could get rich from starting your\r\nown company in 1890 and in 2020, but in 1960 it was not really a\r\nviable option. You couldn't break through the oligopolies to get\r\nat the markets. So the prestigious route in 1960 was not to start\r\nyour own company, but to work your way up the corporate ladder at\r\nan existing one.\r\n<font color=\"#dddddd\">[<a href=\"#f6n\"><font color=\"#dddddd\">6</font></a>]</font><br/><br/>Making everyone a corporate employee decreased economic inequality\r\n(and every other kind of variation), but if your model of normal\r\nis the mid 20th century, you have a very misleading model in that\r\nrespect. J. P. Morgan's economy turned out to be just a phase, and\r\nstarting in the 1970s, it began to break up.<br/><br/>Why did it break up? Partly senescence. The big companies that\r\nseemed models of scale and efficiency in 1930 had by 1970 become\r\nslack and bloated. By 1970 the rigid structure of the economy was\r\nfull of cosy nests that various groups had built to insulate\r\nthemselves from market forces. During the Carter administration the\r\nfederal government realized something was amiss and began, in a\r\nprocess they called \"deregulation,\" to roll back the policies that\r\npropped up the oligopolies.<br/><br/>But it wasn't just decay from within that broke up J. P. Morgan's\r\neconomy. There was also pressure from without, in the form of new\r\ntechnology, and particularly microelectronics. The best way to\r\nenvision what happened is to imagine a pond with a crust of ice on\r\ntop. Initially the only way from the bottom to the surface is around\r\nthe edges. But as the ice crust weakens, you start to be able to\r\npunch right through the middle.<br/><br/>The edges of the pond were pure tech: companies that actually\r\ndescribed themselves as being in the electronics or software business.\r\nWhen you used the word \"startup\" in 1990, that was what you meant.\r\nBut now startups are punching right through the middle of the ice\r\ncrust and displacing incumbents like retailers and TV networks and\r\ncar companies.\r\n<font color=\"#dddddd\">[<a href=\"#f7n\"><font color=\"#dddddd\">7</font></a>]</font><br/><br/>But though the breakup of J. P. Morgan's economy created a new world\r\nin the technological sense, it was a reversion to the norm in the\r\nsocial sense. If you only look back as far as the mid 20th century,\r\nit seems like people getting rich by starting their own companies\r\nis a recent phenomenon. But if you look back further, you realize\r\nit's actually the default. So what we should expect in the future\r\nis more of the same. Indeed, we should expect both the number and\r\nwealth of founders to grow, because every decade it gets easier to\r\nstart a startup.<br/><br/>Part of the reason it's getting easier to start a startup is social.\r\nSociety is (re)assimilating the concept. If you start one now, your\r\nparents won't freak out the way they would have a generation ago,\r\nand knowledge about how to do it is much more widespread. But the\r\nmain reason it's easier to start a startup now is that it's cheaper.\r\nTechnology has driven down the cost of both building products and\r\nacquiring customers.<br/><br/>The decreasing cost of starting a startup has in turn changed the\r\nbalance of power between founders and investors. Back when starting\r\na startup meant building a factory, you needed investors' permission\r\nto do it at all. But now investors need founders more than founders\r\nneed investors, and that, combined with the increasing amount of\r\nventure capital available, has driven up valuations.\r\n<font color=\"#dddddd\">[<a href=\"#f8n\"><font color=\"#dddddd\">8</font></a>]</font><br/><br/>So the decreasing cost of starting a startup increases the number\r\nof rich people in two ways: it means that more people start them,\r\nand that those who do can raise money on better terms.<br/><br/>But there's also a third factor at work: the companies themselves\r\nare more valuable, because newly founded companies grow faster than\r\nthey used to. Technology hasn't just made it cheaper to build and\r\ndistribute things, but faster too.<br/><br/>This trend has been running for a long time. IBM, founded in 1896,\r\ntook 45 years to reach a billion 2020 dollars in revenue.\r\nHewlett-Packard, founded in 1939, took 25 years. Microsoft, founded\r\nin 1975, took 13 years. Now the norm for fast-growing companies is\r\n7 or 8 years.\r\n<font color=\"#dddddd\">[<a href=\"#f9n\"><font color=\"#dddddd\">9</font></a>]</font><br/><br/>Fast growth has a double effect on the value of founders' stock.\r\nThe value of a company is a function of its revenue and its growth\r\nrate. So if a company grows faster, you not only get to a billion\r\ndollars in revenue sooner, but the company is more valuable when\r\nit reaches that point than it would be if it were growing slower.<br/><br/>That's why founders sometimes get so rich so young now. The low\r\ninitial cost of starting a startup means founders can start young,\r\nand the fast growth of companies today means that if they succeed\r\nthey could be surprisingly rich just a few years later.<br/><br/>It's easier now to start and grow a company than it has ever been.\r\nThat means more people start them, that those who do get better\r\nterms from investors, and that the resulting companies become more\r\nvaluable. Once you understand how these mechanisms work, and that\r\nstartups were suppressed for most of the 20th century, you don't\r\nhave to resort to some vague right turn the country took under\r\nReagan to explain why America's Gini coefficient is increasing. Of\r\ncourse the Gini coefficient is increasing. With more people starting\r\nmore valuable companies, how could it not be?<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><b>Notes</b><br/><br/>[<a name=\"f1n\"><font color=\"#000000\">1</font></a>]\r\nInvestment firms grew rapidly after a regulatory change by\r\nthe Labor Department in 1978 allowed pension funds to invest in\r\nthem, but the effects of this growth were not yet visible in the\r\ntop 100 fortunes in 1982.<br/><br/>[<a name=\"f2n\"><font color=\"#000000\">2</font></a>]\r\nGeorge Mitchell deserves mention as an exception. Though\r\nreally driven and good at making deals, he was also the first to\r\nfigure out how to use fracking to get natural gas out of shale.<br/><br/>[<a name=\"f3n\"><font color=\"#000000\">3</font></a>]\r\nWhen I say people are starting more companies, I mean the\r\ntype of company meant to <a href=\"growth.html\"><u>grow</u></a> \r\nvery big. There has actually been a\r\ndecrease in the last couple decades in the overall number of new\r\ncompanies. But the vast majority of companies are small retail and\r\nservice businesses. So what the statistics about the decreasing\r\nnumber of new businesses mean is that people are starting fewer\r\nshoe stores and barber shops.<br/><br/>People sometimes get <a href=\"https://www.inc.com/magazine/201505/leigh-buchanan/the-vanishing-startups-in-decline.html\"><u>confused</u></a> when they see a graph labelled\r\n\"startups\" that's going down, because there are two senses of the\r\nword \"startup\": (1) the founding of a company, and (2) a particular\r\ntype of company designed to grow big fast. The statistics mean\r\nstartup in sense (1), not sense (2).<br/><br/>[<a name=\"f4n\"><font color=\"#000000\">4</font></a>]\r\nRockoff, Hugh. \"Great Fortunes of the Gilded Age.\" NBER Working\r\nPaper 14555, 2008.<br/><br/>[<a name=\"f5n\"><font color=\"#000000\">5</font></a>]\r\nLind, Michael. <i>Land of Promise.</i> HarperCollins, 2012.<br/><br/>It's also likely that the high tax rates in the mid 20th century\r\ndeterred people from starting their own companies. Starting one's\r\nown company is risky, and when risk isn't rewarded, people opt for\r\n<a href=\"inequality.html\"><u>safety</u></a> instead.<br/><br/>But it wasn't simply cause and effect. The oligopolies and high tax\r\nrates of the mid 20th century were all of a piece. Lower taxes are\r\nnot just a cause of entrepreneurship, but an effect as well: the\r\npeople getting rich in the mid 20th century from real estate and\r\noil exploration lobbied for and got huge tax loopholes that made\r\ntheir effective tax rate much lower, and presumably if it had been\r\nmore common to grow big companies by building new technology, the\r\npeople doing that would have lobbied for their own loopholes as\r\nwell.<br/><br/>[<a name=\"f6n\"><font color=\"#000000\">6</font></a>]\r\nThat's why the people who did get rich in the mid 20th century\r\nso often got rich from oil exploration or real estate. Those were\r\nthe two big areas of the economy that weren't susceptible to\r\nconsolidation.<br/><br/>[<a name=\"f7n\"><font color=\"#000000\">7</font></a>]\r\nThe pure tech companies used to be called \"high technology\" startups.\r\nBut now that startups can punch through the middle of the ice crust,\r\nwe don't need a separate name for the edges, and the term \"high-tech\"\r\nhas a decidedly <a href=\"https://books.google.com/ngrams/graph?content=high+tech&amp;year_start=1900&amp;year_end=2019&amp;corpus=en-2019&amp;smoothing=3\"><u>retro</u></a> \r\nsound.<br/><br/>[<a name=\"f8n\"><font color=\"#000000\">8</font></a>]\r\nHigher valuations mean you either sell less stock to get a\r\ngiven amount of money, or get more money for a given amount of\r\nstock. The typical startup does some of each. Obviously you end up\r\nricher if you keep more stock, but you should also end up richer\r\nif you raise more money, because (a) it should make the company\r\nmore successful, and (b) you should be able to last longer before\r\nthe next round, or not even need one. Notice all those shoulds\r\nthough. In practice a lot of money slips through them.<br/><br/>It might seem that the huge rounds raised by startups nowadays\r\ncontradict the claim that it has become cheaper to start one. But\r\nthere's no contradiction here; the startups that raise the most are\r\nthe ones doing it by choice, in order to grow faster, not the ones\r\ndoing it because they need the money to survive. There's nothing\r\nlike not needing money to make people offer it to you.<br/><br/>You would think, after having been on the side of labor in its fight\r\nwith capital for almost two centuries, that the far left would be\r\nhappy that labor has finally prevailed. But none of them seem to\r\nbe. You can almost hear them saying \"No, no, not <i>that</i> way.\"<br/><br/>[<a name=\"f9n\"><font color=\"#000000\">9</font></a>]\r\nIBM was created in 1911 by merging three companies, the most\r\nimportant of which was Herman Hollerith's Tabulating Machine Company,\r\nfounded in 1896. In 1941 its revenues were $60 million.<br/><br/>Hewlett-Packard's revenues in 1964 were $125 million.<br/><br/>Microsoft's revenues in 1988 were $590 million.<br/><br/><br/><br/><b>Thanks</b> to Trevor Blackwell, Jessica Livingston, Bob Lesko, Robert Morris, \r\nRuss Roberts, and Alex Tabarrok for reading drafts of this, and to Jon Erlichman for growth data.<br/><br/></font>","date":"2021-04-01T00:00:00Z"}