{"href":"siliconvalley.html","title":"How to Be Silicon Valley","content":"<font face=\"verdana\" size=\"2\">May 2006<br/><br/><i>(This essay is derived from a keynote at Xtech.)</i><br/><br/>Could you reproduce Silicon Valley elsewhere, or is there something\nunique about it?<br/><br/>It wouldn't be surprising if it were hard to reproduce in other\ncountries, because you couldn't reproduce it in most of the US\neither.  What does it take to make a silicon valley even here?<br/><br/>What it takes is the right people.  If you could get the right ten\nthousand people to move from Silicon Valley to Buffalo, Buffalo\nwould become Silicon Valley.  \n<font color=\"#777777\">[<a href=\"#f1n\"><font color=\"#777777\">1</font></a>]</font><br/><br/>That's a striking departure from the past.  Up till a couple decades\nago, geography was destiny for cities.  All great cities were located\non waterways, because cities made money by trade, and water was the\nonly economical way to ship.<br/><br/>Now you could make a great city anywhere, if you could get the right\npeople to move there.  So the question of how to make a silicon\nvalley becomes: who are the right people, and how do you get them\nto move?<br/><br/><b>Two Types</b><br/><br/>I think you only need two kinds of people to create a technology\nhub: rich people and nerds.  They're the limiting reagents in the\nreaction that produces startups, because they're the only ones\npresent when startups get started.  Everyone else will move.<br/><br/>Observation bears this out: within the US, towns have become startup\nhubs if and only if they have both rich people and nerds.  Few\nstartups happen in Miami, for example, because although it's full\nof rich people, it has few nerds.  It's not the kind of place nerds\nlike.<br/><br/>Whereas Pittsburgh has the opposite problem: plenty of nerds, but\nno rich people.  The top US Computer Science departments are said\nto be MIT, Stanford, Berkeley, and Carnegie-Mellon.  MIT yielded\nRoute 128.  Stanford and Berkeley yielded Silicon Valley.  But\nCarnegie-Mellon?  The record skips at that point.  Lower down the\nlist, the University of Washington yielded a high-tech community\nin Seattle, and the University of Texas at Austin yielded one in\nAustin.  But what happened in Pittsburgh?  And in Ithaca, home of\nCornell, which is also high on the list?<br/><br/>I grew up in Pittsburgh and went to college at Cornell, so I can\nanswer for both.  The weather is terrible,  particularly in winter,\nand there's no interesting old city to make up for it, as there is\nin Boston.  Rich people don't want to live in Pittsburgh or Ithaca.\nSo while there are plenty of hackers who could start startups,\nthere's no one to invest in them.<br/><br/><b>Not Bureaucrats</b><br/><br/>Do you really need the rich people?  Wouldn't it work to have the\ngovernment invest in the nerds?  No, it would not.  Startup investors\nare a distinct type of rich people.  They tend to have a lot of\nexperience themselves in the technology business.  This (a) helps\nthem pick the right startups, and (b) means they can supply advice\nand connections as well as money.  And the fact that they have a\npersonal stake in the outcome makes them really pay attention.<br/><br/>Bureaucrats by their nature are the exact opposite sort of people\nfrom startup investors. The idea of them making startup investments\nis comic.  It would be like mathematicians running <i>Vogue</i>-- or\nperhaps more accurately, <i>Vogue</i> editors running a math journal.\n<font color=\"#777777\">[<a href=\"#f2n\"><font color=\"#777777\">2</font></a>]</font><br/><br/>Though indeed, most things bureaucrats do, they do badly.   We just\ndon't notice usually, because they only have to compete against\nother bureaucrats.  But as startup investors they'd have to compete\nagainst pros with a great deal more experience and motivation.<br/><br/>Even corporations that have in-house VC groups generally forbid\nthem to make their own investment decisions.  Most are only allowed\nto invest in deals where some reputable private VC firm is willing\nto act as lead investor.<br/><br/><b>Not Buildings</b><br/><br/>If you go to see Silicon Valley, what you'll see are buildings.\nBut it's the people that make it Silicon Valley, not the buildings.\nI read occasionally about attempts to set up \"<a href=\"http://www.google.com/search?q=technology+park\">technology\nparks</a>\" in other places, as if the active ingredient of Silicon\nValley were the office space.  An article about Sophia Antipolis\nbragged that companies there included Cisco, Compaq, IBM, NCR, and\nNortel.  Don't the French realize these aren't startups?<br/><br/>Building office buildings for technology companies won't get you a\nsilicon valley, because the key stage in the life of a startup\nhappens before they want that kind of space.  The key stage is when\nthey're three guys operating out of an apartment.  Wherever the\nstartup is when it gets funded, it will stay.  The defining quality\nof Silicon Valley is not that Intel or Apple or Google have offices\nthere, but that they were <i>started</i> there.<br/><br/>So if you want to reproduce Silicon Valley, what you need to reproduce\nis those two or three founders sitting around a kitchen table\ndeciding to start a company.  And to reproduce that you need those\npeople.<br/><br/><b>Universities</b><br/><br/>The exciting thing is, <i>all</i> you need are the people.  If you could\nattract a critical mass of nerds and investors to live somewhere,\nyou could reproduce Silicon Valley.  And both groups are highly\nmobile.  They'll go where life is good.  So what makes a place good\nto them?<br/><br/>What nerds like is other nerds.  Smart people will go wherever other\nsmart people are.  And in particular, to great universities.  In\ntheory there could be other ways to attract them, but so far\nuniversities seem to be indispensable.  Within the US, there are\nno technology hubs without first-rate universities-- or at least,\nfirst-rate computer science departments.<br/><br/>So if you want to make a silicon valley, you not only need a\nuniversity, but one of the top handful in the world.  It has to be\ngood enough to act as a magnet, drawing the best people from thousands\nof miles away.  And that means it has to stand up to existing magnets\nlike MIT and Stanford.<br/><br/>This sounds hard.  Actually it might be easy.  My professor friends,\nwhen they're deciding where they'd like to work, consider one thing\nabove all: the quality of the other faculty.  What attracts professors\nis good colleagues.  So if you managed to recruit, en masse, a\nsignificant number of the best young researchers, you could create\na first-rate university from nothing overnight.  And you could do\nthat for surprisingly little.  If you paid 200 people hiring bonuses\nof $3 million apiece, you could put together a faculty that would\nbear comparison with any in the world.  And from that point the\nchain reaction would be self-sustaining.  So whatever it costs to\nestablish a mediocre university, for an additional half billion or\nso you could have a great one.  \n<font color=\"#777777\">[<a href=\"#f3n\"><font color=\"#777777\">3</font></a>]</font><br/><br/><b>Personality</b><br/><br/>However, merely creating a new university would not be enough to\nstart a silicon valley. The university is just the seed.  It has\nto be planted in the right soil, or it won't germinate.  Plant it\nin the wrong place, and you just create Carnegie-Mellon.<br/><br/>To spawn startups, your university has to be in a town that has\nattractions other than the university.  It has to be a place where\ninvestors want to live, and students want to stay after they graduate.<br/><br/>The two like much the same things, because most startup investors\nare nerds themselves.  So what do nerds look for in a town?  Their\ntastes aren't completely different from other people's, because a\nlot of the towns they like most in the US are also big tourist\ndestinations: San Francisco, Boston, Seattle.   But their tastes\ncan't be quite mainstream either, because they dislike other big\ntourist destinations, like New York, Los Angeles, and Las Vegas.<br/><br/>There has been a lot written lately about the \"creative class.\" The\nthesis seems to be that as wealth derives increasingly from ideas,\ncities will prosper only if they attract those who have them.  That\nis certainly true; in fact it was the basis of Amsterdam's prosperity\n400 years ago.<br/><br/>A lot of nerd tastes they share with the creative class in general.\nFor example, they like well-preserved old neighborhoods instead of\ncookie-cutter suburbs, and locally-owned shops and restaurants\ninstead of national chains.  Like the rest of the creative class,\nthey want to live somewhere with personality.<br/><br/>What exactly is personality?  I think it's the feeling that each\nbuilding is the work of a distinct group of people.  A town with\npersonality is one that doesn't feel mass-produced.  So if you want\nto make a startup hub-- or any town to attract the \"creative class\"--\nyou probably have to ban large development projects.\nWhen a large tract has been developed by a single organization, you\ncan always tell. \n<font color=\"#777777\">[<a href=\"#f4n\"><font color=\"#777777\">4</font></a>]</font><br/><br/>Most towns with personality are old, but they don't have to be.\nOld towns have two advantages: they're denser, because they were\nlaid out before cars, and they're more varied, because they were\nbuilt one building at a time.  You could have both now.  Just have\nbuilding codes that ensure density, and ban large scale developments.<br/><br/>A corollary is that you have to keep out the biggest developer of\nall: the government.  A government that asks \"How can we build a\nsilicon valley?\" has probably ensured failure by the way they framed\nthe question.  You don't build a silicon valley; you let one grow.<br/><br/><b>Nerds</b><br/><br/>If you want to attract nerds, you need more than a town with\npersonality.  You need a town with the right personality.  Nerds\nare a distinct subset of the creative class, with different tastes\nfrom the rest.  You can see this most clearly in New York, which\nattracts a lot of creative people, but few nerds. \n<font color=\"#777777\">[<a href=\"#f5n\"><font color=\"#777777\">5</font></a>]</font><br/><br/>What nerds like is the kind of town where people walk around smiling.\nThis excludes LA, where no one walks at all, and also New York,\nwhere people walk, but not smiling. When I was in grad school in\nBoston, a friend came to visit from New York.  On the subway back\nfrom the airport she asked \"Why is everyone smiling?\"  I looked and\nthey weren't smiling.  They just looked like they were compared to\nthe facial expressions she was used to.<br/><br/>If you've lived in New York, you know where these facial expressions\ncome from.  It's the kind of place where your mind may be excited,\nbut your body knows it's having a bad time.  People don't so much\nenjoy living there as endure it for the sake of the excitement.\nAnd if you like certain kinds of excitement, New York is incomparable.\nIt's a hub of glamour, a magnet for all the shorter half-life\nisotopes of style and fame.<br/><br/>Nerds don't care about glamour, so to them the appeal of New York\nis a mystery.  People who like New York will pay a fortune for a\nsmall, dark, noisy apartment in order to live in a town where the\ncool people are really cool.  A nerd looks at that deal and sees\nonly: pay a fortune for a small, dark, noisy apartment.<br/><br/>Nerds <i>will</i> pay a premium to live in a town where the smart people\nare really smart, but you don't have to pay as much for that.  It's\nsupply and demand: glamour is popular, so you have to pay a lot for\nit.<br/><br/>Most nerds like quieter pleasures.  They like cafes instead of\nclubs; used bookshops instead of fashionable clothing shops; hiking\ninstead of dancing; sunlight instead of tall buildings.  A nerd's\nidea of paradise is Berkeley or Boulder.<br/><br/><b>Youth</b><br/><br/>It's the young nerds who start startups, so it's those specifically\nthe city has to appeal to.  The startup hubs in the US are all\nyoung-feeling towns.  This doesn't mean they have to be new.\nCambridge has the oldest town plan in America, but it feels young\nbecause it's full of students.<br/><br/>What you can't have, if you want to create a silicon valley, is a\nlarge, existing population of stodgy people.  It would be a waste\nof time to try to reverse the fortunes of a declining industrial town\nlike Detroit or Philadelphia by trying to encourage startups.  Those\nplaces have too much momentum in the wrong direction.  You're better\noff starting with a blank slate in the form of a small town.  Or\nbetter still, if there's a town young people already flock to, that\none.<br/><br/>The Bay Area was a magnet for the young and optimistic for decades\nbefore it was associated with technology.  It was a place people\nwent in search of something new.  And so it became synonymous with\nCalifornia nuttiness.  There's still a lot of that there.  If you\nwanted to start a new fad-- a new way to focus one's \"energy,\" for\nexample, or a new category of things not to eat-- the Bay Area would\nbe the place to do it.  But a place that tolerates oddness in the\nsearch for the new is exactly what you want in a startup hub, because\neconomically that's what startups are.  Most good startup ideas\nseem a little crazy; if they were obviously good ideas, someone\nwould have done them already.<br/><br/>(How many people are going to want computers in their <i>houses</i>?\nWhat, <i>another</i> search engine?)<br/><br/>That's the connection between technology and liberalism.  Without\nexception the high-tech cities in the US are also the most liberal.\nBut it's not because liberals are smarter that this is so.  It's\nbecause liberal cities tolerate odd ideas, and smart people by\ndefinition have odd ideas.<br/><br/>Conversely, a town that gets praised for being \"solid\" or representing\n\"traditional values\" may be a fine place to live, but it's never\ngoing to succeed as a startup hub.  The 2004 presidential election,\nthough a disaster in other respects, conveniently supplied us with\na county-by-county <a href=\"http://www-personal.umich.edu/~mejn/election/2004/countymaplinearlarge.png\">\nmap</a> of such places.  \n<font color=\"#777777\">[<a href=\"#f6n\"><font color=\"#777777\">6</font></a>]</font><br/><br/>To attract the young, a town must have an intact center.  In most\nAmerican cities the center has been abandoned, and the growth, if\nany, is in the suburbs.  Most American cities have been turned\ninside out. But none of the startup hubs has: not San Francisco,\nor Boston, or Seattle.  They all have intact centers.\n<font color=\"#777777\">[<a href=\"#f7n\"><font color=\"#777777\">7</font></a>]</font>\nMy guess is that no city with a dead center could be turned into a\nstartup hub.  Young people don't want to live in the suburbs.<br/><br/>Within the US, the two cities I think could most easily be turned\ninto new silicon valleys are Boulder and Portland.  Both have the\nkind of effervescent feel that attracts the young.  They're each\nonly a great university short of becoming a silicon valley, if they\nwanted to.<br/><br/><b>Time</b><br/><br/>A great university near an attractive town.  Is that all it takes?\nThat was all it took to make the original Silicon Valley.  Silicon\nValley traces its origins to William Shockley, one of the inventors\nof the transistor.  He did the research that won him the Nobel Prize\nat Bell Labs, but when he started his own company in 1956 he moved\nto Palo Alto to do it.   At the time that was an odd thing to do.\nWhy did he?  Because he had grown up there and remembered how nice\nit was.  Now Palo Alto is suburbia, but then it was a charming\ncollege town-- a charming college town with perfect weather and San\nFrancisco only an hour away.<br/><br/>The companies that rule Silicon Valley now are all descended in\nvarious ways from Shockley Semiconductor.  Shockley was a difficult\nman, and in 1957 his top people-- \"the traitorous eight\"-- left to\nstart a new company, Fairchild Semiconductor.  Among them were\nGordon Moore and Robert Noyce, who went on to found Intel, and\nEugene Kleiner, who founded the VC firm Kleiner Perkins.  Forty-two\nyears later, Kleiner Perkins funded Google, and the partner responsible\nfor the deal was John Doerr, who came to Silicon Valley in 1974 to\nwork for Intel.<br/><br/>So although a lot of the newest companies in Silicon Valley don't\nmake anything out of silicon, there always seem to be multiple links\nback to Shockley.  There's a lesson here: startups beget startups.\nPeople who work for startups start their own.  People who get rich\nfrom startups fund new ones.  I suspect this kind of organic growth\nis the only way to produce a startup hub, because it's the only way\nto grow the expertise you need.<br/><br/>That has two important implications.  The first is that you need\ntime to grow a silicon valley.  The university you could create in\na couple years, but the startup community around it has to grow\norganically.   The cycle time is limited by the time it takes a\ncompany to succeed, which probably averages about five years.<br/><br/>The other implication of the organic growth hypothesis is that you\ncan't be somewhat of a startup hub.  You either have a self-sustaining\nchain reaction, or not.  Observation confirms this too: cities\neither have a startup scene, or they don't.  There is no middle\nground.  Chicago has the third largest metropolitan area in America.\nAs a source of startups it's negligible compared to Seattle, number 15.<br/><br/>The good news is that the initial seed can be quite small.  Shockley\nSemiconductor, though itself not very successful, was big enough.\nIt brought a critical mass of experts in an important new technology\ntogether in a place they liked enough to stay.<br/><br/><b>Competing</b><br/><br/>Of course, a would-be silicon valley faces an obstacle the original\none didn't: it has to compete with Silicon Valley.  Can that be\ndone?  Probably.<br/><br/>One of Silicon Valley's biggest advantages is its venture capital\nfirms.  This was not a factor in Shockley's day, because VC funds\ndidn't exist.  In fact, Shockley Semiconductor and Fairchild\nSemiconductor were not startups at all in our sense.  They were\nsubsidiaries-- of Beckman Instruments and Fairchild Camera and\nInstrument respectively.  Those companies were apparently willing\nto establish subsidiaries wherever the experts wanted to live.<br/><br/>Venture investors, however, prefer to fund startups within an hour's\ndrive.  For one, they're more likely to notice startups nearby.\nBut when they do notice startups in other towns they prefer them\nto move.  They don't want to have to travel to attend board meetings,\nand in any case the odds of succeeding are higher in a startup hub.<br/><br/>The centralizing effect of venture firms is a double one: they cause\nstartups to form around them, and those draw in more startups through\nacquisitions.  And although the first may be weakening because it's\nnow so cheap to start some startups, the second seems as strong as ever.\nThree of the most admired\n\"Web 2.0\" companies were started outside the usual startup hubs,\nbut two of them have already been reeled in through acquisitions.<br/><br/>Such centralizing forces make it harder for new silicon valleys to\nget started.  But by no means impossible.  Ultimately power rests\nwith the founders.  A startup with the best people will beat one\nwith funding from famous VCs, and a startup that was sufficiently\nsuccessful would never have to move.  So a town that\ncould exert enough pull over the right people could resist and\nperhaps even surpass Silicon Valley.<br/><br/>For all its power, Silicon Valley has a great weakness: the paradise\nShockley found in 1956 is now one giant parking lot.  San Francisco\nand Berkeley are great, but they're forty miles away.  Silicon\nValley proper is soul-crushing suburban <a href=\"http://www.flickr.com/photos/caterina/34637/\">sprawl</a>.  It\nhas fabulous weather, which makes it significantly better than the\nsoul-crushing sprawl of most other American cities.  But a competitor\nthat managed to avoid sprawl would have real leverage.  All a city\nneeds is to be the kind of place the next traitorous eight look at\nand say \"I want to stay here,\" and that would be enough to get the\nchain reaction started.<br/><br/><br/><br/><br/><br/><b>Notes</b><br/><br/>[<a name=\"f1n\"><font color=\"#000000\">1</font></a>]\nIt's interesting to consider how low this number could be\nmade.  I suspect five hundred would be enough, even if they could\nbring no assets with them.  Probably just thirty, if I could pick them, \nwould be enough to turn Buffalo into a significant startup hub.<br/><br/>[<a name=\"f2n\"><font color=\"#000000\">2</font></a>]\nBureaucrats manage to allocate research funding moderately\nwell, but only because (like an in-house VC fund) they outsource\nmost of the work of selection.  A professor at a famous university\nwho is highly regarded by his peers will get funding, pretty much\nregardless of the proposal.  That wouldn't work for startups, whose\nfounders aren't sponsored by organizations, and are often unknowns.<br/><br/>[<a name=\"f3n\"><font color=\"#000000\">3</font></a>]\nYou'd have to do it all at once, or at least a whole department\nat a time, because people would be more likely to come if they\nknew their friends were.  And you should probably start from scratch,\nrather than trying to upgrade an existing university, or much energy\nwould be lost in friction.<br/><br/>[<a name=\"f4n\"><font color=\"#000000\">4</font></a>]\nHypothesis: Any plan in which multiple independent buildings\nare gutted or demolished to be \"redeveloped\" as a single project\nis a net loss of personality for the city, with the exception of\nthe conversion of buildings not previously public, like warehouses.<br/><br/>[<a name=\"f5n\"><font color=\"#000000\">5</font></a>]\nA few startups get started in New York, but less\nthan a tenth as many per capita as in Boston, and mostly\nin less nerdy fields like finance and media.<br/><br/>[<a name=\"f6n\"><font color=\"#000000\">6</font></a>]\nSome blue counties are false positives (reflecting the\nremaining power of Democractic party machines), but there are no\nfalse negatives.  You can safely write off all the red counties.<br/><br/>[<a name=\"f7n\"><font color=\"#000000\">7</font></a>]\nSome \"urban renewal\" experts took a shot at destroying Boston's\nin the 1960s, leaving the area around city hall a bleak <a href=\"http://www.pps.org/great_public_spaces/one?public_place_id=148\">wasteland</a>,\nbut most neighborhoods successfully resisted them.<br/><br/><b>Thanks</b> to Chris Anderson, Trevor Blackwell, Marc Hedlund,\nJessica Livingston, Robert Morris, Greg Mcadoo, Fred Wilson,\nand Stephen Wolfram for\nreading drafts of this, and to Ed Dumbill for inviting me to speak.<br/><br/>(The second part of this talk became <a href=\"america.html\">Why Startups\nCondense in America</a>.)<br/><br/></font>","date":"2006-05-01T00:00:00Z"}