{"href":"submarine.html","title":"The Submarine","content":"<font face=\"verdana\" size=\"2\">April 2005<br/><br/>\"Suits make a corporate comeback,\" says the <a href=\"http://www.nytimes.com/2005/04/14/fashion/thursdaystyles/14peacock.html?ex=1271131200&amp;en=e96f2670387e3636&amp;ei=5090&amp;partner=rssuserland\"><i>New\nYork Times</i></a>.  Why does this sound familiar?  Maybe because\nthe suit was also back in <a href=\"http://www.cvbizlink.com/articles/2005/04/07/news/news/doc42406f05edf53293947237.prt\">February</a>,\n<!-- <a href=\"http://www.startribune.com/stories/1761/5209354.html\">January</a>,\n-->\n<a href=\"http://www.usatoday.com/money/industries/retail/2004-09-01-suits_x.htm\">September\n2004</a>, <a href=\"http://www.cnn.com/2004/BUSINESS/06/23/go.fashion.jones/\">June\n2004</a>, <a href=\"http://www.post-gazette.com/pg/04062/279616.stm\">March\n2004</a>, <a href=\"http://www.southcoasttoday.com/daily/09-03/09-21-03/c01li238.htm\">September\n2003</a>, \n<!-- <a href=\"http://houston.bizjournals.com/eastbay/stories/2003/02/24/daily34.html\">February\n2003</a>, -->\n<a href=\"http://www.businessweek.com/magazine/content/02_46/b3808122.htm\">November\n2002</a>, \n<a href=\"http://www.pittsburghlive.com/x/s_65540.html\">April 2002</a>,\nand <a href=\"http://news.bbc.co.uk/1/hi/business/1836010.stm\">February\n2002</a>.\n<!-- <a\nhref=\"http://www.businessweek.com/magazine/content/01_14/b3726092.htm\">April\n2001</a>. -->\n<!-- Are these all describing the same comeback-- in which case\nthe <i>Times</i> style section is two years behind <i>Business Week</i> in\nmatters of fashion-- or do fashions now last only a few months? --><br/><br/>Why do the media keep running stories saying suits are back?  Because\nPR firms <a href=\"http://www.maximumexposurepr.com/middleMAA.html\">tell</a> \nthem to.  One of the most surprising things I discovered\nduring my brief business career was the existence of the PR industry,\nlurking like a huge, quiet submarine beneath the news.  Of the\nstories you read in traditional media that aren't about politics,\ncrimes, or disasters, more than half probably come from PR firms.<br/><br/>I know because I spent years hunting such \"press hits.\"  Our startup spent\nits entire marketing budget on PR: at a time when we were assembling\nour own computers to save money, we were paying a PR firm $16,000\na month.  And they were worth it.  PR is the news equivalent of\nsearch engine optimization; instead of buying ads, which readers\nignore, you get yourself inserted directly into the stories.  <font color=\"#777777\">[<a href=\"https://paulgraham.com/submarine.html#f1n\" name=\"f1\"><font color=\"#777777\">1</font></a>]</font><br/><br/><a href=\"http://schwartz-pr.com/client_coverage.php\">Our PR firm</a>\nwas one of the best in the business.  In 18 months, they got press\nhits in over 60 different publications.  <!-- They made us into stars. -->\nAnd we weren't the only ones they did great things for.  \nIn 1997 I got a call from another\nstartup founder considering hiring them to promote his company.  I\ntold him they were PR gods, worth every penny of their outrageous   \nfees.  But I remember thinking his company's name was odd.\nWhy call an auction site \"eBay\"?<br/><br/>\n<b>Symbiosis</b><br/><br/>PR is not dishonest.  Not quite.  In fact, the reason the best PR\nfirms are so effective is precisely that they aren't dishonest.\nThey give reporters genuinely valuable information.  A good PR firm\nwon't bug reporters just because the client tells them to; they've\nworked hard to build their credibility with reporters, and they\ndon't want to destroy it by feeding them mere propaganda.<br/><br/>If anyone is dishonest, it's the reporters.  The main reason PR  \nfirms exist is that reporters are lazy.  Or, to put it more nicely,\noverworked.  Really they ought to be out there digging up stories\nfor themselves.  But it's so tempting to sit in their offices and\nlet PR firms bring the stories to them.  After all, they know good\nPR firms won't lie to them.<br/><br/>A good flatterer doesn't lie, but tells his victim selective truths\n(what a nice color your eyes are). Good PR firms use the same\nstrategy: they give reporters stories that are true, but whose truth\nfavors their clients.<br/><br/>For example, our PR firm often pitched stories about how the Web  \nlet small merchants compete with big ones.  This was perfectly true.\nBut the reason reporters ended up writing stories about this\nparticular truth, rather than some other one, was that small merchants\nwere our target market, and we were paying the piper.<br/><br/>Different publications vary greatly in their reliance on PR firms.\nAt the bottom of the heap are the trade press, who make most of\ntheir money from advertising and would give the magazines away for\nfree if advertisers would let them.  <font color=\"#777777\">[<a href=\"https://paulgraham.com/submarine.html#f2n\" name=\"f2\"><font color=\"#777777\">2</font></a>]</font> The average\ntrade publication is a  bunch of ads, glued together by just enough\narticles to make it look like a magazine.  They're so desperate for\n\"content\" that some will print your press releases almost verbatim,\nif you take the trouble to write them to read like articles.<br/><br/>At the other extreme are publications like the <i>New York Times</i>\nand the <i>Wall Street Journal</i>.  Their reporters do go out and\nfind their own stories, at least some of the time.  They'll listen \nto PR firms, but briefly and skeptically.  We managed to get press   \nhits in almost every publication we wanted, but we never managed \nto crack the print edition of the <i>Times</i>.  <font color=\"#777777\">[<a href=\"https://paulgraham.com/submarine.html#f3n\" name=\"f3\"><font color=\"#777777\">3</font></a>]</font><br/><br/>The weak point of the top reporters is not laziness, but vanity.\nYou don't pitch stories to them.  You have to approach them as if\nyou were a specimen under their all-seeing microscope, and make it\nseem as if the story you want them to run is something they thought \nof themselves.<br/><br/>Our greatest PR coup was a two-part one.  We estimated, based on\nsome fairly informal math, that there were about 5000 stores on the\nWeb.  We got one paper to print this number, which seemed neutral   \nenough.  But once this \"fact\" was out there in print, we could quote\nit to other publications, and claim that with 1000 users we had 20%\nof the online store market.<br/><br/>This was roughly true.  We really did have the biggest share of the\nonline store market, and 5000 was our best guess at its size.  But\nthe way the story appeared in the press sounded a lot more definite.<br/><br/>Reporters like definitive statements.  For example, many of the\nstories about Jeremy Jaynes's conviction say that he was one of the\n10 worst spammers.  This \"fact\" originated in Spamhaus's ROKSO list,\nwhich I think even Spamhaus would admit is a rough guess at the top\nspammers.  The first stories about Jaynes cited this source, but\nnow it's simply repeated as if it were part of the indictment.   \n<font color=\"#777777\">[<a href=\"https://paulgraham.com/submarine.html#f4n\" name=\"f4\"><font color=\"#777777\">4</font></a>]</font><br/><br/>All you can say with certainty about Jaynes is that he was a fairly\nbig spammer.  But reporters don't want to print vague stuff like\n\"fairly big.\"  They want statements with punch, like \"top ten.\" And\nPR firms give them what they want.\nWearing suits, we're told, will make us \n<a href=\"http://sanfrancisco.bizjournals.com/sanfrancisco/stories/2002/02/25/story5.html?t=printable\">3.6\npercent</a> more productive.<br/><br/><b>Buzz</b><br/><br/>Where the work of PR firms really does get deliberately misleading is in\nthe generation of \"buzz.\"  They usually feed the same story to    \nseveral different publications at once.  And when readers see similar\nstories in multiple places, they think there is some important trend\nafoot.  Which is exactly what they're supposed to think.<br/><br/>When Windows 95 was launched, people waited outside stores\nat midnight to buy the first copies.  None of them would have been\nthere without PR firms, who generated such a buzz in\nthe news media that it became self-reinforcing, like a nuclear chain\nreaction.<br/><br/>I doubt PR firms realize it yet, but the Web makes it possible to  \ntrack them at work.  If you search for the obvious phrases, you\nturn up several efforts over the years to place stories about the  \nreturn of the suit.  For example, the Reuters article \n<!-- by Elizabeth Lazarowitz -->\nthat got picked up by <a href=\"http://www.usatoday.com/money/industries/retail/2004-09-01-suits_x.htm\">USA\nToday</a> in September 2004.  \"The suit is back,\" it begins.<br/><br/>Trend articles like this are almost always the work of\nPR firms.  Once you know how to read them, it's straightforward to\nfigure out who the client is.  With trend stories, PR firms usually\nline up one or more \"experts\" to talk about the industry generally. \nIn this case we get three: the NPD Group, the creative director of\nGQ, and a research director at Smith Barney.  <font color=\"#777777\">[<a href=\"https://paulgraham.com/submarine.html#f5n\" name=\"f5\"><font color=\"#777777\">5</font></a>]</font> When\nyou get to the end of the experts, look for the client. And bingo, \nthere it is: The Men's Wearhouse.<br/><br/>Not surprising, considering The Men's Wearhouse was at that moment \nrunning ads saying \"The Suit is Back.\"  Talk about a successful\npress hit-- a wire service article whose first sentence is your own\nad copy.<br/><br/>The secret to finding other press hits from a given pitch\nis to realize that they all started from the same document back at\nthe PR firm.  Search for a few key phrases and the names of the\nclients and the experts, and you'll turn up other variants of this \nstory.<br/><br/><a href=\"http://bostonworks.boston.com/globe/articles/091904_suit.html\">Casual\nfridays are out and dress codes are in</a> writes Diane E. Lewis\nin <i>The Boston Globe</i>.  In a remarkable coincidence, Ms. Lewis's\nindustry contacts also include the creative director of GQ.<br/><br/><a href=\"http://www.usnews.com/usnews/biztech/articles/041108/8eedress.htm\">Ripped jeans and T-shirts are out,</a> writes Mary Kathleen Flynn in\n<i>US News &amp; World Report</i>.  And <i>she too</i> knows the \ncreative director of GQ.<br/><br/><a href=\"http://www.sexbuzz.com/style/9,0004,00.shtml\">Men's suits\nare back</a> writes Nicole Ford in Sexbuzz.Com (\"the ultimate men's\nentertainment magazine\").<br/><br/><a href=\"http://www.detnews.com/2004/careers/0405/28/b01-149207.htm\">Dressing\ndown loses appeal as men suit up at the office</a> writes Tenisha\nMercer of <i>The Detroit News</i>.<br/><br/>\nNow that so many news articles are online, I suspect you could find\na similar pattern for most trend stories placed by PR firms.  I\npropose we call this new sport \"PR diving,\" and I'm sure there are\nfar more striking examples out there than this clump of five stories.<br/><br/><b>Online</b><br/><br/>After spending years chasing them, it's now second nature\nto me to recognize press hits for what they are.  But before we\nhired a PR firm I had no idea where articles in the mainstream media\ncame from.  I could tell a lot of them were crap, but I didn't\nrealize why.<br/><br/>Remember the exercises in critical reading you did in school, where\nyou had to look at a piece of writing and step back and ask whether\nthe author was telling the whole truth?  If you really want to be\na critical reader, it turns out you have to step back one step\nfurther, and ask not just whether the author is telling the truth,\nbut <i>why he's writing about this subject at all.</i><br/><br/>Online, the answer tends to be a lot simpler.  Most people who\npublish online write what they write for the simple reason that\nthey want to.  You\ncan't see the fingerprints of PR firms all over the articles, as\nyou can in so many print publications-- which is one of the reasons,\nthough they may not consciously realize it, that readers trust\nbloggers more than <i>Business Week</i>.<br/><br/>I was talking recently to a friend who works for a\nbig newspaper.  He thought the print media were in serious trouble,\nand that they were still mostly in denial about it.  \"They think\nthe decline is cyclic,\" he said.  \"Actually it's structural.\"<br/><br/>In other words, the readers are leaving, and they're not coming\nback.<br/><br/>\nWhy? I think the main reason is that the writing online is more honest.\nImagine how incongruous the <i>New York Times</i> article about\nsuits would sound if you read it in a blog:\n  <blockquote> The urge to look corporate-- sleek, commanding,\n  prudent, yet with just a touch of hubris on your well-cut sleeve--\n  is an unexpected development in a time of business disgrace.\n  </blockquote> \nThe problem\nwith this article is not just that it originated in a PR firm.\nThe whole tone is bogus.  This is the tone of someone writing down\nto their audience.<br/><br/>Whatever its flaws, the writing you find online\nis authentic.  It's not mystery meat cooked up\nout of scraps of pitch letters and press releases, and pressed into \nmolds of zippy\njournalese.  It's people writing what they think.<br/><br/>I didn't realize, till there was an alternative, just how artificial\nmost of the writing in the mainstream media was.  I'm not saying\nI used to believe what I read in <i>Time</i> and <i>Newsweek</i>.  Since high\nschool, at least, I've thought of magazines like that more as\nguides to what ordinary people were being\n<a href=\"https://paulgraham.com/say.html\">told</a> to think than as  \nsources of information.  But I didn't realize till the last  \nfew years that writing for publication didn't have to mean writing\nthat way.  I didn't realize you could write as candidly and\ninformally as you would if you were writing to a friend.<br/><br/>Readers aren't the only ones who've noticed the\nchange.  The PR industry has too.\nA hilarious <a href=\"http://www.prsa.org/_Publications/magazines/0802news1.asp\">article</a>\non the site of the PR Society of America gets to the heart of the   \nmatter:\n  <blockquote> Bloggers are sensitive about becoming mouthpieces\n  for other organizations and companies, which is the reason they\n  began blogging in the first place.  </blockquote>\nPR people fear bloggers for the same reason readers\nlike them.  And that means there may be a struggle ahead.  As\nthis new kind of writing draws readers away from traditional media, we\nshould be prepared for whatever PR mutates into to compensate.  \nWhen I think   \nhow hard PR firms work to score press hits in the traditional   \nmedia, I can't imagine they'll work any less hard to feed stories\nto bloggers, if they can figure out how.<br/><br/><br/><br/>\n<b>Notes</b><br/><br/>[<a name=\"f1n\"><font color=\"#000000\">1</font></a>] PR has at least   \none beneficial feature: it favors small companies.  If PR didn't  \nwork, the only alternative would be to advertise, and only big\ncompanies can afford that.<br/><br/>[<a name=\"f2n\"><font color=\"#000000\">2</font></a>] Advertisers pay \nless for ads in free publications, because they assume readers \nignore something they get for free.  This is why so many trade\npublications nominally have a cover price and yet give away free\nsubscriptions with such abandon.<br/><br/>[<a name=\"f3n\"><font color=\"#000000\">3</font></a>] Different sections\nof the <i>Times</i> vary so much in their standards that they're\npractically different papers.  Whoever fed the style section reporter\nthis story about suits coming back would have been sent packing by\nthe regular news reporters.<br/><br/>[<a name=\"f4n\"><font color=\"#000000\">4</font></a>] The most striking\nexample I know of this type is the \"fact\" that the Internet worm   \nof 1988 infected 6000 computers. I was there when it was cooked up,\nand this was the recipe: someone guessed that there were about\n60,000 computers attached to the Internet, and that the worm might\nhave infected ten percent of them.<br/><br/>Actually no one knows how many computers the worm infected, because\nthe remedy was to reboot them, and this destroyed all traces.  But\npeople like numbers.  And so this one is now <a href=\"http://www.google.com/search?q=internet+worm+1988+6000\">replicated</a>\nall over the Internet, like a little worm of its own.<br/><br/>[<a name=\"f5n\"><font color=\"#000000\">5</font></a>] Not all were\nnecessarily supplied by the PR firm. Reporters sometimes call a few\nadditional sources on their own, like someone adding a few fresh \nvegetables to a can of soup.<br/><br/><!-- [<a name=\"f6n\"><font color=#000000>6</font></a>] More precisely,\nthey're driven by a kind of devotion that includes a large admixture\nof vanity.  But writers have always been like this, no matter what the\nmedium.\n-->\n<b>Thanks</b> to Ingrid Basset, Trevor Blackwell, Sarah Harlin, Jessica \nLivingston, Jackie McDonough, Robert Morris, and Aaron Swartz (who\nalso found the PRSA article) for reading drafts of this.<br/><br/><b>Correction:</b> Earlier versions used a recent\n<i>Business Week</i> article mentioning del.icio.us as an example\nof a press hit, but Joshua Schachter tells me \nit was spontaneous.<br/><br/></font>","date":"2005-04-01T00:00:00Z"}